#!/usr/bin/python3
#filename 2_10.py
'''
Άσκηση 2.10

Δύο αντιστάσεις συνδέονται σε σειρά και στις άκρες του συστήματος συνδέεται πηγή
τάσης V = 100V. Αν είναι R1 = 5Ω και R2 = 15Ω, να βρείτε την ολική αντίσταση
του συστήματος, την ένταση του ρεύματος, που διαρρέει το κύκλωμα
και την τάση στα άκρα κάθε αντίστασης.

'''


#Δεδομένα
R1=5                            #Αντίσταση σε Ω
R2=15                            #Αντίσταση σε Ω
V=100                            #Τάση σε V


print()
I = V/(R1+R2)
print('Ισχύει Ι=V/Rol => I = V/(R1+R2) => I={:.2f} A'.format(I))

print('V1=I*R1 => V1={:.2f} V'.format(I*R1))
print('V2=I*R2 => V2={:.2f} V'.format(I*R2))
