#!/usr/bin/python3
# filename 2_12.py
"""
Άσκηση 2.12

Στα παρακάτω κυκλώματα να βρείτε:
α) την ολική αντίσταση του συστήματος,
β) την τάση στα άκρα κάθε αντίστασης,
γ) την ένταση του ρεύματος, που διαρρέει κάθε αντίσταση.
"""

# Δεδομένα
R1 = 3  # Αντίσταση σε Ω
R2 = 6  # Αντίσταση σε Ω
R3 = 4  # Αντίσταση σε Ω
V = 60  # Τάση σε V

print()
RΑΒ = (R1 * R2) / (R1 + R2)
print('H Αντίσταση RAB=(R1*R2)/(R1+R2) => RΑΒ={:.2f} Ω'.format(RΑΒ))
RAΓ = RΑΒ + R3
print('H Αντίσταση RAΓ=RAB+R3 => RAΓ={:.2f} A'.format(RAΓ))
print()

V3 = V * (R3 / RAΓ)
print('Στα άκρα της αντίσταση R3 ισχύει V3=Iol*R3 και επειδή Ιol=V/RAΓ => V3=V*(R3/RAΓ) => V3={:.2f} V'.format(V3))
V1 = V2 = V - V3
print('Στα άκρα των  R1 και R2 ισχύει V1=V2 επίσης V=V1+V3, άρα V1=V2=V-V3 => V1={:.2f} V'.format(V1))
print()

I1 = V1 / R1
print('I1=V1/R1 => I1={:.2f} A'.format(I1))
I2 = V2 / R2
print('I2=V2/R2 => I2={:.2f} A'.format(I2))
I3 = V3 / R3
print('I3=V3/R3 => I3={:.2f} A'.format(I3))
