#!/usr/bin/python3
# filename 2_14.py
"""
Άσκηση 2.14

Στο παρακάτω κύκλωμα η ένδειξη του βολτομέτρου είναι 4V, η τάση της πηγής είναι
V= 10V και οι αντιστάσεις R1 = 2Ω, R2 = 4Ω, R3 =4Ω, R4 = 5Ω και R5 = 11Ω.
Να βρείτε την ένδειξη του αμπερομέτρου και την αντίσταση RΧ .
Το βολτόμετρο έχει άπειρη αντίσταση, ενώτο αμπερόμετρο έχει μηδενική αντίσταση,
δηλαδή θεωρούνται ιδανικά όργανα.
"""

# Δεδομένα
R1 = 2  # Αντίσταση σε Ω
R2 = 4  # Αντίσταση σε Ω
R3 = 4  # Αντίσταση σε Ω
R4 = 5  # Αντίσταση σε Ω
R5 = 11  # Αντίσταση σε Ω
V23 = V2 = V3 = 4  # Ένδειξη βολτόμετρου σε V
V = 10  # Τάση Πηγής σε V

print()

print('H τάση στα άκρα των αντιστάσεων  R2 και R3 είναι η ένδειξη του βολτομέτρου V2')
I2 = V2 / R2
I3 = V2 / R3
I1 = I2 + I3
print('I2=V2/R2 => I2={:.2f} A'.format(I2))
print('I3=V2/R3 => I3={:.2f} A'.format(I3))
print('I1=I2+I3 => I1={:.2f} A'.format(I1))
print()

V1 = I1 * R1
V123 = V1 + V23
V45 = V123
print('V1=I1*R1 =>      V1={:.2f} V'.format(V1))
print('V123=V1+V23 => V123={:.2f} V'.format(V123))
print('V45=V123 =>     V45={:.2f} V'.format(V45))
print()

R45 = R4 + R5
I45 = V45 / R45
print('Η ένδειξη του αμπερομέτρου είναι I45=V45/R45 =>  I45={:.2f} Α'.format(I45))

print()
Iol = I45 + I1
Rx = (V - V45) / Iol
print('Ισχύει ότι Iol=I45+I1 και V45=V-Rx*Iol άρα Rx=(V-V45)/Iol =>  Rx={:.2f} Ω'.format(Rx))
