#!/usr/bin/python3
#filename 2_16.py
'''
Άσκηση 2.16

Στο παρακάτω κύκλωμα δίνονται V=30V, R1=2Ω, R2=1Ω, R3=5Ω και R4=10Ω.
α) Να βρείτε την τάση VAB.
β) Να βρείτε την αντίσταση R που πρέπει να συνδέσουμε παράλληλα με την R4, ώστε
   VΑΒ = 0.
'''
from math import sqrt

#Δεδομένα
R1=2                            #Αντίσταση σε Ω
R2=1                            #Αντίσταση σε Ω
R3=5                            #Αντίσταση σε Ω
R4=10                           #Αντίσταση σε Ω
V=30                            #Τάση σε V

print()
print('----------A.----------------')
print('Σύμφωνα με τον νόμο του Kirchof I=I1+I2')

R12=R1+R2
R34=R3+R4
I12=V/(R1+R2)
I34=V/(R3+R4)
print('Ισχύει I12=V/(R1+R2) => I12={:.2f} Ω'.format(I12))
print('Ισχύει I34=V/(R3+R4) => I34={:.2f} Ω'.format(I34))

print()
VΑΒ=I12*R2-I34*R4
print('VAB=VΑΔ+VΔΒ => VΑΒ=I1*R2-I2*R4 => VΑΒ={:.2f} V'.format(VΑΒ))


print()
print('----------B.----------------')
print('Έστω R5 η αντίσταση που θα τοποθετήσουμε παράλληλα στην R4')
print('Έστω I1 το ρεύμα που διέρχεται από την R1 και R2')
print('Έστω I3 το ρεύμα που διέρχεται από την R3')
print('Έστω I4 το ρεύμα που διέρχεται από την R4')
print('Έστω I5 το ρεύμα που διέρχεται από την R5')
print()


I1 = V / (R1+R2)
print('Iσχύει V = I1*R1 + I1*R2 => I1 = V / (R1+R2)                            => I1 = {:>5.2f} Ω'.format(I1))
I4 = I1*R2 / R4
print('Επειδή VΑΒ=0 => Ι1*R2=I4*R4 => I4 = I1*R2 / R4                          => I4 = {:>5.2f} Ω'.format(I4))
I3=(V-(I4*R4))/R3
print('Iσχύει V = I3*R3 + I4*R4 => I3*R3=V-(I4*R4)=>I3=(V-(I4*R4))/R3          => I3 = {:>5.2f} Ω'.format(I3))
I5=I3-I4
print('Σύμφωνα με τον νόμο του Kirchof I3=I4+I5 => I5=I3-I4                    => I5 = {:>5.2f} Ω'.format(I5))
R5=(V-(I3*R3))/I5
print('Τέλος επειδή VV = I3*R3 + I5*R5 => I3*R3=V-(I5*R5)=>R5=(V-(I3*R3))/I5   => R5 = {:>5.2f} Ω'.format(R5))
