#!/usr/bin/python3
# filename 2_17.py
"""
Άσκηση 2.17

Να βρείτε την ολική αντίσταση μεταξύ τωνΑ και Β στις παρακάτω συνδεσμολογίες, αν
R = 30Ω.
"""
# Δεδομένα
R = 30  # Αντίσταση σε Ω

print()
print('A. Στην περιπτωση Α οι 3 αντιστάσεις είναι συνδεδεμένες παράλληλα, οπότε ισχύει:')
print('1/Rol =1/R + 1/R +1/R => Rol=R/3 => Rol={:.2f}'.format(R / 3))
print()

print('B. Στην περιπτωση Β οι 2 αντιστάσεις στο τμήμα ΔΒΓ είναι στην σειρά:')
print('RΔΒΓ =R + R => RΔΒΓ=2*R')
print('Στην συνέχεια έχουμε την περίπτωση Α ')
print('1/Rol =1/R + 1/R +1/RΔΒΓ => Rol=3*R/5 => Rol={:.2f}'.format(3 * R / 5))
