#!/usr/bin/python3
# filename 2_18.py
"""
Άσκηση 2.18

Στο  παρακάτω  κύκλωμα  δίνονται:
R1 = R2 = R3 = 10Ω, V1 = 20V, V2 = 10V.
Να βρείτε τα δυναμικά των σημείων Α, Β, Γ και Δ.

"""
# Δεδομένα
R1 = R2 = R3 = 10  # Αντιστάσεις σε Ω
V1 = 20  # Τάση σε V
V2 = 10  # Τάση σε V

print()
print('Ο κλάδος ΒΖ δε διαρρέεται από ρεύμα.')
I = V1 / (R1 + R2)
print('Έτσι I=V1/(R1+R2) => I={:.2f}'.format(I))
print('Είναι:')
print('VZ=0')
print('VΔ-VZ=0 =>V∆ = VΖ ⇒ V∆ = 0V')
print('VA - VB = I ⋅ R1 => VA - (-10) = 1 ⋅ 10 => VA + 10 =  10 => VA = 0V')
print('VB − VΓ = I*R2 => −10 − VΓ = 1⋅10 => VΓ = −10 − 10 => VΓ = −20V')
