#!/usr/bin/python3
#filename 2_20.py
'''
Άσκηση 2.20

Θεωρούμε ένα ισοπαχύ και ομογενή κυκλικό αγωγό κέντρου Κ
και τέσσερα σημεία του Α, Β, Γ, Δ τέτοια ώστε,
ΑΒ = ΒΓ = ΓΔ = ΔΑ = 90°.
Τα σημεία Α και Β συνδέονται με τάση VAB = 60V.

α) Να βρείτε τη διαφορά δυναμικού VΑΓ .
β) Αν γειώσουμε το Δ, να βρείτε το δυναμικό του σημείου Γ.
'''


#Δεδομένα
VAB=60                    #Τάση σε V


print()
print(---------------A.-----------------)
print('Έστω R η αντίσταση του αγωγού.')
print('Είναι: RAB=R/4 και RΑΓΒ=3*R/4')
print('I1=VAB/RAB => I1=240/R)
print('I2=VAB/RAΓB => I1=240/3*R)
print('RΑΓ=R/2  έτσι:')
print('VAΓ=I2*RAΓ => VAΓ=(240*R)/(2*R*2)=> VAΓ=40 V')
print()


print(---------------B.-----------------)
print('VΔ=0, είναι: RΔΓ=R/4')
print('VΔΓ=I2*RΔΓ => VΔΓ= (240*R)/(3*R*4) => VΔΓ=20 V')
print('VΔ-VΓ=20 V =>0-VΓ=20 V=> VΓ=-20V')
