#!/usr/bin/python3
# filename 2_21.py
"""
Άσκηση 2.21

Δίνονται τέσσερις αντιστάτες με αντιστάσεις
R1 = 2Ω, R2 = 4Ω, R3 = 6Ω, R4 = 8Ω. Πώςπρέπει
να τους συνδέσουμε για να έχουμε ολική αντίσταση
Rολ = 5Ω; Αν τότε τροφοδοτήσουμε τη διάταξη
με πηγή, ο αντιστάτης R3 διαρρέεται από ρεύμα
έντασης I3 = 2Α. Να βρείτε την ένταση του
ρεύματος που διαρρέει τον αντιστάτη R4.
"""

# Δεδομένα
R1 = 2  # Αντίσταση σε Ω
R2 = 4  # Αντίσταση σε Ω
R3 = 6  # Αντίσταση σε Ω
R4 = 8  # Αντίσταση σε Ω
Rol = 5  # Αντίσταση σε Ω
I3 = 2  # Ένταση σε Α

print()
R14 = (R1 + R4)
print('Τις R1 και R4 σε σειρά, ώστε R14={:.2f} A'.format(R14))
R23 = (R2 + R3)
print('τις R2 και R3 σε σειρά, ώστε R23={:.2f} A'.format(R23))
print('και τις R14 και R23 παράλληλα, ώστε Rολ=5Ω')
print()
V = I3 * R23
print('Ισχύει V=I3*R23 => V={:.2f} V'.format(V))
I4 = V / R14
print('Επίσης V=I4*R14 => I4=V/R14=>I4={:.2f} A'.format(I4))
