#!/usr/bin/python3
#filename 2_26.py
'''
Άσκηση 2.26

Στο παρακάτω κύκλωμα, να βρείτε σε J τη
θερμότητα που εκλύεται σε κάθε αντίσταση
σε χρόνο t = 1 min.
'''

#Δεδομένα
R1=10       #Αντίσταση σε Ω
R2=10       #Αντίσταση σε Ω
R3=5        #Αντίσταση σε Ω
R4=90       #Αντίσταση σε Ω
R5=11       #Αντίσταση σε Ω
V=180       #Τάση σε V
t=60        #Χρόνος σε sec


#CRED = '\x1b[6;30;42m'
#CEND = '\x1b[0m'

print()
print('Η αντίστασεις R1 και R2 είναι παράλληλες, άρα:')
R12= (R1*R2)/(R1+R2)
print('R12= (R1*R2)/(R1+R2) =>R12={:.2f} Ω'.format(R12))

print()
print('Η αντίσταση που προκύπτει R12 είναι σε σειρά με την R3, οπότε:')
R123=R12+R3
#print('R123=R12+R3 =>{} R123={:.2f} Ω {}'.format(CRED, R123, CEND))  colorized text
print('R123=R12+R3 => R123={:.2f} Ω'.format(R123))

print()
print('Έτσι έχουμε την αντίσταση R123 η οποία είναι παράλληλη με την R4, άρα:')
R1234=R123*R4/(R123+R4)
print('R1234=R123*R4/(R123+R4) => R1234={:.2f} Ω'.format(R1234))

print()
print('Η αντίσταση που προκύπτει R1234 είναι σε σειρά με την R5, οπότε:')
R12345=R1234+R5
print('R12345=R1234+R5 => R12345={:.2f} Ω'.format(R12345))

print()
I5=V/R12345
print('I5=V/R12345 => I5={:.2f} A'.format(I5))

print()
I1234=(V-I5*R5)/R1234
print('V=I1234*R1234+I5*R5 => I1234=(V-I5*R5)/R1234 => I1234={:.2f} A'.format(I1234))
I4=I1234*R1234/R4
print('Ισχύει όμως I1234*R1234=I4*R4 => I4=I1234*R1234/R4 =>I4={:.2f} A'.format(I4))
Q4=(I4**2)*R4*t
print('Η Θερμότητα που εκλύεται στην R4 είναι Q4=I4²*R4*t => Q4={:.2f} J'.format(Q4))

print()
I123=(I4*R4)/(R12+R3)
print('V4=I4*R4 =>I123*(R12+R3)=I4*R4 =>I123=(I4*R4)/(R12+R3) => I123={:.2f} A'.format(I123))
Q3=(I123**2)*R3*t
print('Η Θερμότητα που εκλύεται στην R3 είναι Q3=I123²*R3*t =>  Q3={:.2f} J'.format(Q3))

print()
I12=(I4*R4-I123*R3)/R12
print('Ισχύει όμως I12*R12+I123*R3=I4*R4 => I12=(I4*R4-I123*R3)/R12 =>I12={:.2f} A'.format(I12))
I2=I12*R12/R2
print('Ισχύει όμως I12*R12=I2*R2 => I2=I12*R12/R2 =>I2={:.2f} A'.format(I2))
Q2=(I2**2)*R2*t
print('Η Θερμότητα που εκλύεται στην R2 είναι Q2=I2²*R2*t =>  Q2={:.2f} J'.format(Q2))

print()
I1=I2
print('Ισχύει I1*R1=I2*R2 και επειδή R1=R2 => I2=I1 =>I1={:.2f} A'.format(I1))
Q1=(I1**2)*R1*t
print('Η Θερμότητα που εκλύεται στην R1 είναι Q1=I1²*R2*t =>  Q1={:.2f} J'.format(Q1))

