#!/usr/bin/python3
# filename 2_28.py
"""
Άσκηση 2.28

Σε μια ηλεκτρική οικιακή εγκατάσταση λει-
τουργούν ταυτόχρονα: α) Ηλεκτρική κουζί-
να ισχύος 1,5KW, β) θερμοσίφωνας ισχύος
2KW, γ) ηλεκτρικό ψυγείο ισχύος 1KW, δ) 5
λαμπτήρες ισχύος 100W καθένας. Να βρείτε
πόσα Α πρέπει να είναι η γενική ασφάλεια
του πίνακα εγκατάστασης και πόσο θα στοι-
χίσει η λειτουργία τους για 10h.
Δίνεται ότι η τάση λειτουργίας των συσκευ-
ών είναι ίση με την τάση του δικτύου, δηλ.
220V και ότι το 1KWh κοστίζει 0,1€.
"""

# Δεδομένα
P1 = 1.5  # Ισχύς Κουζίνας σε KW
P2 = 2  # Ισχύς Θερμοσίφωνα σε KW
P3 = 1  # Ισχύς Ψυγείου σε KW
P4 = 5 * 0.1  # Ισχύς σε KW
t = 10  # χρόνος σε h
K = 0.1  # Κόστος σε €/KWh
V = 220  # Τάση σε V

print()
print('Η συνολική αποροφούμενη ηλεκτρική ισχύς είναι:')
Pηλ = P1 + P2 + P3 + P4
print('Pηλ=P1+P2+P3+P4 => Pηλ={:.2f} KW'.format(Pηλ))

print()
I = (10 ** 3) * Pηλ / V
print('Pηλ=V*I => I=Pηλ/V =>Ι={:.2f} Α'.format(I))

print()
print('Χρειάζεται Γενική ασφάλεια 25Α')
print()

print('Η λειτουργία για {}h στοιχίζει: {}KW*{}€*{}h={:.2f}€ '.format(t, Pηλ, K, t, Pηλ * t * K))
