#!/usr/bin/python3
# filename 2_3.py
"""
Άσκηση 2.3

Να βρείτε τη μέση ταχύτητα (ταχύτητα διολίσθησης), με την οποία κινούνται
τα ελεύθερα ηλεκτρόνια μέσα σ’ ένα μεταλλικό αγωγό,
σε συνάρτηση με τα εξής μεγέθη:

α) Ι: ένταση του ρεύματος που διαρρέει τοναγωγό,
β) n: ο αριθμός των ελευθέρων ηλεκτρονίων ανά μονάδα όγκου του αγωγού
γ) S: εμβαδό διατομής του αγωγού,
δ) qe : φορτίο του ηλεκτρονίου.

Αριθμητική εφαρμογή: Ι = 16Α, n = 8·10^23 ηλ/cm3, S = 1mm2, qe= -1,6·10^-19C.
"""

# Δεδομένα
Ι = 16  # Η ένταση του ρεύματος σε A.
n = 8 * 10 ** 29  # αριθμός ηλεκτρονίων ανα m3
qe = -1.6 * 10 ** (-19)  # Φορτίο ηλεκτρονίου σε C
S = 10 ** (-6)  # διατομή αγωγού σε m2

print()
print(
    'Η ένταση του ρεύματος είναι I= Q/Δt => I=N*|qe|/Δt  (1), όπου Ν ο συνολικός αριθμός \n των ελεύθερων ηλεκτρονίων')
print('Ισχύει ότι Ν=V*n (2), όπου V o όγκος του αγωγού και n η πυκνότητα των ηλεκτρονίων')
print('Ισχύει επίσης V=S*l (3) όπου l το μήκος τους αγωγού και l=u*Δt (4) με u την ταχύτητα των ηλεκτρονίων')
print('Άρα:')
print('(1) + (2) => I=|qe|*Vn/Δt και με βάση την (3) Ι=|qe|*S*l/Δt που με την (4) γίνεται:')
print('I=|qe|*S*u/n \t αν αντικαταστήσουμε τα δεδομένα έχουμε:')
u = Ι / (abs(qe) * S * n)
print('u={:.2e} m/sec'.format(u))
