#!/usr/bin/python3
#filename 2_31.py
'''
Άσκηση 2.31

Για τη μεταφορά ηλεκτρικής ισχύος 720KW
σε απόσταση 50Km το ποσοστό απώλειας
ισχύος στη γραμμή μεταφοράς είναι 10%.
Να βρεθούν οι τάσεις στην είσοδο και την
έξοδο της γραμμής, αν η διατομή των χάλκι-
νων αγωγών είναι 10mm 2 και η ειδική αντί-
σταση του χαλκού 1,8·10^-8 Ω·m.
'''

from math import sqrt

#Δεδομένα
P1=720*10**3          #Ισχύς σε KW
l=2*50*10**3      #Απόσταση σε m
n=0.1           #Απώλειες
S=10*10**(-6)      #Διατομή σε m2
r=1.8*10**(-8)  #Ειδική αντίσταση σε Ω*m


print()
R=r*l/S 
print('Η αντίσταση της γραμμής μεταφοράς είναι: R=r*l/S => R={:.2f} Ω'.format(R))
Pa=n*P1
print('Για την ισχύς απωλειών ισχύει: Pa=n*P1 => Pa={:.2f} KW'.format(Pa))
print()
I=sqrt(Pa/R)
print('όμως: Pa=I²*R => I=√(Pa/R)=> I= {:.2f} A'.format(I))
V1=P1/I
print('Η αρχική τάση V1 είναι V1=P1/I => V1= {:.2f} V'.format(V1))
V2=(P1-Pa)/I
print('Η τάση στο τέλος της γραμμής είναι V2=(P1-Pa)/I => V2={:.2f}V'.format(V2))
