#!/usr/bin/python3
#filename 2_32.py
'''
Άσκηση 2.32

Μία ηλεκτρική θερμάστρα αναγράφει τα
στοιχεία «2000W-200V». Να βρείτε την αντί-
στασή της και το ρεύμα κανονικής λειτουρ-
γίας της. Πόση θα είναι η ισχύς της, αν συν-
δεθεί σε δίκτυο τάσης 160V και ποια ένταση
ρεύματος τη διαρρέει τότε;
'''

from math import sqrt

#Δεδομένα
P=2000          #Ισχύς σε W
Vk=200           #Τάση σε V
V=160           #Τάση σε V


print()
R=(Vk**2)/P
print('Η αντίσταση της είναι: P=Vk²/R =>R= (Vk²/P) =>R={:.2f} Ω'.format(R))
I=P/Vk
print('Το ρεύμα που την διαρέει είναι: P=I*Vk => I=P/Vk =>I={:.2f} A'.format(I))
print()
print('αν συνδεθεί σε δίκτυο τάσης 160V, τότε:')
P2=(V**2)/R
print('P2=V²/R => P2={:.2f} W'.format(P2))
I2=P2/V
print('και θα την διαρέουν I2=P2/V =>I2={:.2f} A'.format(I2))
