#!/usr/bin/python3
#filename 2_34.py
'''
Άσκηση 2.34

Μια ηλεκτρική θερμάστρα αναγράφει τα στοιχεία «100W-200V».
Η θερμάστρα συνδέεται σε σειρά με λαμπτήρα, που αναγράφει
τα στοιχεία «24W-12V». Το σύστημα τροφοδοτείται από 
δίκτυο τάσης 200V. Να εξετάσετε αν ο λαμπτήρας λειτουργεί κανονικά.
'''

from math import sqrt

#Δεδομένα
Pth=100          #Ισχύς σε W
Vth=200          #Τάση σε V
PL=24            #Ισχύς σε W
VL=12            #Τάση σε V


print()
print('Για να λειτουργεί κανονικά ο λαμπτήρας θα πρέπει να δέχεται την')
IL=PL/VL
print('ονομαστική του ένταση που είναι IL= PL/VL => IL={:.2f}A'.format(IL))
print()
print('Η αντίσταση της θερμάστρας είναι: Pth=V²/Rth =>Rth=Vth²/Pth =>')
Rth=(Vth**2)/Pth
print('Rth={:.2f} Ω'. format(Rth))
print('Η αντίσταση του λαμπτήρα είναι: PL=VL²/RL =>RL=VL²/PL =>')
RL=(VL**2)/PL
print('RL={:.2f} Ω'. format(RL))

print()
print('Όταν ο λαμπτήρας συνδέεται σε σειρά με την θερμάστρα τότε')
I=Vth/(Rth+RL)
print('στο κυκλωμα ισχύει: I*(Rth+RL)=V => I={:.2f} A'.format(I))
print('που σημαίνει ότι ο λαμπτήρα διαρρέεται από πολύ μικρότερο')
print('του ονομαστικού του ρεύμα. Άρα υπολειτουργεί')
