#!/usr/bin/python3
# filename 2_35.py
"""
Άσκηση 2.35

Δύο αντιστάτες με αντιστάσεις R1=R2=40Ω
συνδέονται σε σειρά. Στα άκρα του συστή-
ματος εφαρμόζουμε τάση V = 120V. Παράλ-
ληλα στον αντιστάτη R2 συνδέουμε μια θερ-
μική συσκευή με χαρακτηριστικά κανονικής
λειτουργίας VK = 60V και ΡΚ = 90W .
α) Να αποδείξετε ότι η συσκευή δε λειτουρ-
γεί κανονικά.
β) Να βρείτε την αντίσταση R3, ενός άλλου
αντιστάτη που πρέπει να αντικαταστήσει
τον αντιστάτη R1, ώστε η συσκευή να λει-
τουργεί κανονικά.

"""

# Δεδομένα
R1 = R2 = 40  # Αντίσταση σε Ω
V = 120  # Τάση σε V
Pk = 90  # Ισχύς σε W
Vk = 60  # Τάση σε V

print()
print('α) Για να λειτουργεί κανονικά η μηχανή θα πρέπει να την διαρρέει')
Ik = Pk / Vk
print('η ονομαστική της ένταση που είναι Ik= Pk/Vk => Ik={:.2f}A'.format(Ik))
Rk = (Vk ** 2) / Pk
print('Η αντίστασή της είναι: Rk=Vk²/Pk => Rk={:.2f}Ω'.format(Rk))
print()
print('Για να βρούμε το ρέυμα που διαρρέει την Rk θα πρέπει,')
print('να βρούμε το ολικό ρεύμα που διαρρέει το κύκλωμα.')
print('οι αντιστάσεις Rk και R2 είναι παράλληλες => Rk2= (Rk*R2)/(Rk+R2)')
Rk2 = (Rk * R2) / (Rk + R2)
print('Rk2={:.2f} Ω'.format(Rk2))
I = V / (R1 + Rk2)
print('Συνεπώς το συνολικό ρεύμα είναι I=V/(R1+Rk2) (1) =>I={:.2f} Α'.format(I))
print()
print('Η τάση στα άκρα της συσκευής είναι I3*Rk=I*Rk2 (2) από την οποία')
I3 = I * Rk2 / Rk
print('προκύπτει ότι I3=I*Rk2/Rk => I3={:.2f} Α η οποία είναι μικρότερη \
της ονομαστικής'.format(I3))
print('------------------------------------------------------------------')
print()

print('β) Στην σχέση (2) το ρεύμα Ι3 που διαρρέει την αντίσταση θα πρέπει')
print('να ειναι Ι3=Ik=1.5 A')
I3 = 1.5
I = I3 * Rk / Rk2
print('άρα στην σχέση (2) το Ι είναι I=I3*Rk/Rk2 =>I={:.2f} Α'.format(I))
print('που σημαίνει ότι αν στην σχέση (1) λύσουμε ως προς R1, θα έχουμε:')
R1 = (V - I * Rk2) / I
print('R1=(V-I*Rk2)/I => R1={:.2f} Α'.format(R1))
