#!/usr/bin/python3
# filename 2_36.py
"""
Άσκηση 2.36

Όταν το εξωτερικό κύκλωμα έχει αντίσταση
R1 = 1Ω, μια γεννήτρια δίνει ρεύμα έντασης
I1 = 5Α, ενώ, όταν το εξωτερικό κύκλωμα έχει
αντίσταση R2 = 4Ω, η γεννήτρια δίνει ρεύμα
έντασης I2 = 2Α. Πόση είναι η ηλεκτρεγερτική
δύναμη ε και η εσωτερική αντίσταση r τηςγεννήτριας;
"""

# Δεδομένα
R1 = 1  # Αντίσταση σε Ω
R2 = 4  # Αντίσταση σε Ω
I1 = 5  # Ένταση ρεύματος σε A
I2 = 2  # Ένταση ρεύματος σε A

print()
print('Για την ηλεκτρεγερτική δύναμη εφαρμόζουμε τον νόμο του Ohm:')
print('E=I1*(R1+r) (1)\tεπίσης:')
print('E=I2*(R2+r) (2)')
r = (I2 * R2 - I1 * R1) / (I1 - I2)
print('από (1) και (2) => r=(I2*R2-I1*R1) / (I1-I2) => r={:.2f} Ω'.format(r))
print()
E = I1 * (R1 + r)
print('Από την (1) => Ε={:.2f} V'.format(E))
