#!/usr/bin/python3
# filename 2_37.py
"""
Άσκηση 2.37

Όταν οι πόλοι μίας γεννήτριας συνδέονται
με εξωτερική αντίσταση R1 = 8Ω, η τάση
στους πόλους της γεννήτριας είναι V1 = 24V,
ενώ όταν οι πόλοι της γεννήτριας συνδέ-
ονται με εξωτερική αντίσταση R2 = 13Ω, η
τάση στους πόλους της γεννήτριας είναι V2 =26V.
Πόση είναι η ηλεκτρεγερτική δύναμη ε και
η εσωτερική αντίσταση r της γεννήτριας;

"""

# Δεδομένα
R1 = 8  # Αντίσταση σε Ω
R2 = 13  # Αντίσταση σε Ω
V1 = 24  # Τάση σε V
V2 = 26  # Τάση σε V

print()
print('Για την ηλεκτρεγερτική δύναμη εφαρμόζουμε τον νόμο του Ohm:')
print('V1=I1*R1 => V1=E*R1/(R1+r) => E= V1*(R1+r) / R1  (1)  επίσης:')
print('V2=I2*R2 => V2=E*R2/(R2+r) => E= V2*(R2+r) / R1  (2)')
print()

r = (R1 * R2) * (V2 - V1) / (V1 * R2 - V2 * R1)
print('από (1) και (2) => r=(R1*R2)*(V2-V1) / (V1*R2-V2*R1) => r={:.2f} A'.format(r))
print()
E = V1 * (R1 + r) / R1
print('Από την (1) => Ε={:.2f} V'.format(E))
