#!/usr/bin/python3
# filename 2_39.py
"""
Άσκηση 2.39

Δίνεται πηγή με ε = 12V και r = 1Ω. Η πηγή
τροφοδοτεί δύο αντιστάσεις R1=2Ω και R2=3Ω
συνδεμένες σε σειρά. Να βρείτε:
α) την ένταση του ρεύματος, που διαρρέει το κύκλωμα,
β) την πολική τάση της πηγής,
γ) την ισχύ, που παρέχει η πηγή σε όλο το κύκλωμα,
δ) την ισχύ στην εσωτερική αντίσταση της πηγής,
ε) την ισχύ που παρέχει η πηγή στο εξωτερικό κύκλωμα,
στ) την ισχύ σε κάθε μια από τις αντιστάσεις.


"""

# Δεδομένα
R1 = 2  # Αντίσταση σε Ω
R2 = 3  # Αντίσταση σε Ω
r = 1  # Αντίσταση σε Ω
E = 12  # Τάση σε V

print()

# ---------------------------------
print('α) Για την ηλεκτρεγερτική δύναμη Ε εφαρμόζουμε τον νόμο του Ohm:')
print('   E=I*R1+I*R2+I*r => I= E / (R1+R2+r) =>', end='')
I = E / (R1 + R2 + r)
print('I={:.2f} A'.format(I))
# ---------------------------------

print()
print('β) Η τάση V στα άκρα της πηγής είναι E-I*r ={:.2f} V'.format(E - I * r))
# ---------------------------------

print()
Pπηγ = I * E
print('γ) Η ισχύς της πηγής είναι Pπηγ=I*E => Pπηγ={:.2f} W'.format(Pπηγ))
# ---------------------------------

print()
Pr = (I ** 2) * r
print('δ) Η ισχύς της εσωτερικής αντίστασης είναι Pr=I²*r => Pr={:.2f} W'.format(Pr))
# ---------------------------------

print()
Pεξ = (I ** 2) * (R1 + R2)
print('ε) Η ισχύς στο εξωτερικό κύκλωμα είναι Pεξ=I²*(R1+R2) => Pεξ={:.2f} W'.format(Pεξ))
# ---------------------------------

print()
P1 = (I ** 2) * R1
P2 = (I ** 2) * R2
print('ε) Η ισχύς στην R1 είναι P1=I²*(R1) => P1={:.2f} W'.format(P1))
print('   Η ισχύς στην R2 είναι P2=I²*(R2) => P2={:.2f} W'.format(P2))
