#!/usr/bin/python3
#filename 2_4.py
'''
Άσκηση 2.4

Στο παρακάτω διάγραμμα έχει παρασταθεί γραφικά η ένταση του ρεύματος I
σε συνάρτηση με τη διαφορά δυναμικού V για δύο χάλκινα σύρματα Σ1 και Σ2,
που έχουν το ίδιο μήκος. Αν το εμβαδό διατομής του Σ1 είναι S1= 0,2mm2,
να βρείτε το εμβαδό διατομής του Σ2.
'''

#Δεδομένα
S1=0.2*10**(-6)                     # διατομή αγωγού σε m2

print()
print('Ισχύει R1=Vo/Io  και   R2=Vo/2*Io , άρα:')
print('R1/R2=2 => R1=2*R2 <=> ρ*l/S1=2*ρ*l/S2 => \n')
S2=2*S1
print('S2=2*S1 => S2={:.1f} mm2'.format(S2*10**(6)))

