#!/usr/bin/python3
# filename 2_41.py
"""
Άσκηση 2.41

Στο διπλανό κύκλωμα να βρεθούν τα δυναμικά των πόλων της πηγής.

"""

# Δεδομένα
R1 = 17  # Αντίσταση σε Ω
R2 = 8  # Αντίσταση σε Ω
r = 1  # Αντίσταση σε Ω
E = 52  # Τάση σε V

print()

# ---------------------------------
print('Για την ηλεκτρεγερτική δύναμη Ε εφαρμόζουμε τον νόμο του Ohm:')
print('E=I*R1+I*R2+I*r => I= E / (R1+R2+r) =>', end='')
I = E / (R1 + R2 + r)
print('I={:.2f} A'.format(I))

print()
Vπ = E - I * r
print('Η τάση VΓ=0 επειδή είναι σημείο γείωσης')
VΑ = I * R1
print('έχουμε  VΑ-VΓ=I*R1 => VΑ=I*R1 =>  VΑ= {}V'.format(VΑ))
VΒ = -I * R2
print('έχουμε  VΓ-VΒ=I*R2 => VΒ=-I*R2 => VΒ={}V'.format(VΒ))
