#!/usr/bin/python3
# filename 2_42.py
"""
Άσκηση 2.42

Με σύρμα αντίστασης 16Ω σχηματίζουμε
κλειστή περιφέρεια. Δύο σημεία του σύρ-
ματος, που απέχουν ένα τέταρτο της πε-
ριφέρειας, συνδέονται με ηλεκτρική πηγή
ηλεκτρεγερτικής δύναμης 4V και εσωτερικής
αντίστασης 1Ω. Να βρείτε την ένταση του
ρεύματος που διαρρέει κάθε κλάδο του κυ-
κλώματος.
"""

# Δεδομένα
R = 16  # Αντίσταση σε Ω
r = 1  # Αντίσταση σε Ω
E = 4  # Τάση σε V

print()

# ---------------------------------
print('Tο ισοδύναμο του κυκλώματος αντιστοιχεί σε 2 παράλληλες')
R2 = (3 / 4) * R
R1 = (1 / 4) * R
print('αντιστάσεις R1=(3/4)*R = {}Ω και R2=(1/4)*R= {}Ω, οι οποίες είναι'.format(R1, R2))
print('συνδεδεμένες στην πηγή Ε.\n')

print('Αφού οι αντιστάσεις είναι παράλληλες προκύπτει:')
R12 = (R1 * R2) / (R1 + R2)
print('R12=(R1*R2)/(R1+R2) => R12={}Ω \n'.format(R12))
print('Eφαρμόζουμε τον νόμο του Ohm:')
print('E=I*R12+I*r => I= E / (R12+r) =>', end='')
I = E / (R12 + r)
print('I={:.2f} A \tΕπίσης ισχύει:'.format(I))

print('E=I2*R2+I*r => I2= (E-I*r) / R12 =>', end='')
I2 = (E - I * r) / R2
print('I2={} A \t'.format(I2))
print('E=I1*R3+I*r => I1= (E-I*r) / R1 =>', end='')
I1 = (E - I * r) / R1
print('I1={} A \t'.format(I1))
