#!/usr/bin/python3
# filename 2_43.py
"""
Άσκηση 2.43

Μια γεννήτρια έχει ηλεκτρεγερτική δύναμη ε = 24V
και εσωτερική αντίσταση r=1Ω. Το εξωτερικό
κύκλωμα αποτελείται από μια αντίσταση R = 3Ω και
έναν ανεμιστήρα.
Όταν ο ανεμιστήρας δε στρέφεται, το ρεύμα έχει
ένταση Ι = 4Α, ενώ όταν ο ανεμιστή1ρας στρέφεται,
το ρεύμα έχει ένταση I2 = 2Α.

Να βρεθεί:
α) η εσωτερική αντίσταση r ́ του ανεμιστήρα,
β) η θερμική ισχύς σε όλο το κύκλωμα, όταν ο ανεμιστήρας στρέφεται,
γ) η μηχανική ισχύς του ανεμιστήρα,
δ) η απόδοση του ανεμιστήρα.

"""

# Δεδομένα
R = 3  # Αντίσταση σε Ω
r = 1  # Αντίσταση σε Ω
E = 24  # Τάση σε V
I = 4  # Ένταση ρεύματος σε Α
I2 = 2  # Ένταση ρεύματος σε Α

print()

# ---------------------------------
print('α) Όταν ο ανεμιστήρας δε στρέφεται, παρεμβάλλεται στο κύκλωμα ως')
print('ωμική αντίσταση. Έτσι, έχουμε:')
Ra = (E - I * R - I * r) / I
print('E=I*R+I*r+I*Ra => Ra= (E-I*R-I*r) / I => Ra={}Ω'.format(Ra))
print()

print('β) Όταν ο ανεμιστήρας στρέφεται η θερμική ισχύς του κυκλώματος είναι:')
Pk = (I2 ** 2) * (R + r + Ra)
print('Pk=I2²*(R+r+Ra)=> Pk={}W'.format(Pk))

print()
print('γ) Η μηχανική ισχύς του ανεμιστήρα ισούται: ')
Pa = E * I2 - I2 ** 2 * r - I2 ** 2 * R
print('Pa=E*I2-I2²*r-I2²*R => Pa={}W'.format(Pa))

print()
print('δ) H απόδοση του ανεμιστήρα, είναι:')
a = 100 * Pk / Pa
print('a(%)=100*Pk/Pa => a={}%'.format(a))
