#!/usr/bin/python3
# filename 2_44.py
"""
Άσκηση 2.44

Μια γεννήτρια έχει ηλεκτρεγερτική δύναμη
ε = 12V και εσωτερική αντίσταση r = 1Ω. Οι
πόλοι της γεννήτριας συνδέονται με ανεμι-
στήρα. Όταν ο ανεμιστήρας δε στρέφεται, η
τάση στους πόλους της γεννήτριας είναι V1 =8V.
Όταν ο ανεμιστήρας στρέφεται η τάση
στους πόλους της γεννήτριας είναι V2 = 10V.

Να βρεθεί:
α) η εσωτερική αντίσταση ra του ανεμιστήρα,
β) η θερμική ισχύς σε όλο το κύκλωμα, όταν ο ανεμιστήρας στρέφεται,
γ) η μηχανική ισχύς του ανεμιστήρα,
δ) η απόδοση του κυκλώματος.

"""

# Δεδομένα

r = 1  # Αντίσταση σε Ω
E = 12  # Τάση σε V
V1 = 8  # Τάση σε V
V2 = 10  # Τάση σε V

print()

# ---------------------------------
print('α) Όταν ο ανεμιστήρας δε στρέφεται, έχουμε:')
I = (E - V1) / r
print('E=I*r+V1 => I= (E-V1)/r => I={}A'.format(I))
ra = V1 / I
print('και επειδή V1=I*ra => ra=V1/I => ra={}Ω'.format(ra))
print()

print('β) Όταν ο ανεμιστήρας στρέφεται, έχουμε:')
I2 = (E - V2) / r
print('E=I2*r+V2 => I2= (E-V2)/r => I2={}A'.format(I2))
print('Η θερμική ισχύς Pth καταναλώνεται πάνω στις αντιστάσεις, άρα:')
Pth = I2 ** 2 * (r + ra)
print('Pth=I2²*(r+ra)=> Pth={}W'.format(Pth))
print()

print('Η μηχανική ισχύς του ανεμιστήρα είναι:')
print('PG=Pth+Pa,  όπου:\nPG: Ισχύς γεννήτριας και \nPa: Ισχύς ανεμιστήρα \
άρα:')
Pa = E * I2 - Pth
print('E*I2=Pth+Pa => Pa=E*I2-Pth => Pa={}W'.format(Pa))

print()
print('δ) H απόδοση του κυκλώματος, είναι:')
a = 100 * Pa / (E * I2)
print('a(%)=100*Pa/(E*I2) => a={}%'.format(a))
