#!/usr/bin/python3
# filename 2_45.py
"""
Άσκηση 2.45

Στο κύκλωμα της παραπάνω εικόνας δίνεται ότι:
ε1 = 9V, ε2 = 2V, r1 = r2 = 2Ω, R1 = R3 = 4Ω, R2 = 2Ω.
Να βρεθούν οι εντάσεις των ρευμάτων, που διαρρέουν
τους κλάδους του κυκλώματος και η διαφορά δυναμικού VΑΓ .
"""

# Δεδομένα

r1 = r2 = 2  # Αντίσταση σε Ω
R1 = R3 = 4  # Αντίσταση σε Ω
R2 = 2  # Αντίσταση σε Ω
E1 = 9  # Τάση σε V
E2 = 2  # Τάση σε V

print()
print('Έστω Ι1, Ι2 και I3 οι εντάσεις των ρευμάτων που διαρρέουν τους')
print('κλάδους ΔΑΒ, ΒΓΔ και ΒΔ αντίστοιχα. Εφαρμόζοντας τους κανόνες του')
print('Kirchhoff έχουμε:')
print('I3=I1+I2 \t\t (1)')
print('E1=I1*R1+I1*r1+I3*R3 \t (2)')
print('E2=I2*R2+I2*r2+I3*R3 \t (2)')
I1 = (E1 * R2 + E1 * r2 + E1 * R3 - E2 * R3) / (
            R1 * R2 + r1 * R2 + R3 * R2 + R1 * r2 + r1 * r2 + R3 * r2 + R1 * R3 + r1 * R3)
I2 = (E1 - I1 * R1 - I1 * r1 - I1 * R3) / R3
I3 = I1 + I2

print('από την λύση των (1) (2) και (3) προκύπτει: \nI1={} Α\nI2={}A\nI3={}A'.format(I1, I2, I3))
print()

print('Για την διαφορά δυναμικού έχουμε:')
VΑΓ = I1 * R1 - I2 * R2
print('VA-I1*R1+I2*R2=VΓ => VΑΓ=I1*R1-I2*R2 => VΑΓ={} V'.format(VΑΓ))
