#!/usr/bin/python3
# filename 2_46.py
"""
Άσκηση 2.46

Στο κύκλωμα της παραπάνω εικόνας δίνεται ότι:
ε1 = 21V, ε2 = 3V, ε3 = 6V, ε4 = 6V, ε5 = 11V,
R1= 4Ω, R2 = 2Ω, R3 = 3Ω, R4 = 1Ω, R5 = 4Ω.
Να υπολογιστούν οι τιμές των ρευμάτων που
διαρρέουν το κύκλωμα και η διαφορά δυναμικού VAΒ.

"""

# Δεδομένα

R1 = 4  # Αντίσταση σε Ω
R2 = 2  # Αντίσταση σε Ω
R3 = 3  # Αντίσταση σε Ω
R4 = 1  # Αντίσταση σε Ω
R5 = 4  # Αντίσταση σε Ω

E1 = 21  # Τάση σε V
E2 = 3  # Τάση σε V
E3 = 6  # Τάση σε V
E4 = 6  # Τάση σε V
E5 = 11  # Τάση σε V

print()
print('Έστω Ι1, Ι2 και I3 οι εντάσεις των ρευμάτων που διαρρέουν τους')
print('κλάδους ΔΑΒ, ΒΓΔ και ΒΔ αντίστοιχα. Εφαρμόζοντας τους κανόνες του')
print('Kirchhoff έχουμε:')
print('I3=I1+I2 \t\t\t (1)')
print('E4-I2*R4+E5-I2*R5-I3*R3-E3=0 \t (2)')
print('E3+I3*R3+E2+I1*R1-E1+I1*R2=0 \t (3)')
print()
print('η σχέση (1) γίνεται:')
print('{}-{}*I2+{}-{}*I2-{}*I3-{}=0 \t(4)'.format(E4, R4, E5, R5, R3, E3))
print()
print('η σχέση (2 γίνεται:')
print('{}+{}*I3+{}+{}*I1-{}+{}*I1=0 \t(5)'.format(E3, R3, E2, R1, E1, R2))
print()

I1 = 1
I2 = 4 - 3 * I1
I3 = I1 + I2
print('και τελικά προκύπτει ότι: \nI1={}Α \nI2={}A \nI3={}A'.format(I1, I2, I3))
