#!/usr/bin/python3
# filename 2_7.py
"""
Άσκηση 2.7

Ένα σύρμα από σίδηρο έχει αντίσταση R = 40Ω και μήκος l = 2m
Λιώνουμε το σύρμα και φτιάχνουμε ένα άλλο, που θέλουμε να
έχει αντίσταση R′ = 160Ω. Να βρείτε το μήκος του l′ .
"""

from math import sqrt

# Δεδομένα
l = 2  # Μήκος αγωγού σε m
R1 = 40  # Αντίσταση σε Ω
R2 = 160  # Αντίσταση σε Ω

print()
print('Η αντίσταση για τον αρχικό αγωγό δίνεται από την σχέση R1=ρ*l/S1  (1) όπου S1 η διατομή.')
print('Η αντίσταση του αγωγού μετά, δίνεται από την σχέση R2=ρ*l2/S2  (2) όπου S2 η διατομή του μετά το λιώσιμο.')
print('Ισχύει επίσης V=S1*l και V=S2*l2 καθώτι ο όγκος του αγωγού παραμένει ίδιος, άρα:')
print('S2/S1=l/l2 (3)')
print('Από (1) και (2) έχουμε: R1/R2=(l/l2)*(S2/S1) και αν αντικαταστήσουμε την (3), προκύπτει:')
l2 = l * sqrt(R2 / R1)
print('l2=l1*√(R2/R1) => l2={:.2f} m.'.format(l2))
