#!/usr/bin/python3
# filename 2_8.py
"""
Άσκηση 2.8

Σε ποια θερμοκρασία θ η τιμή της ειδικής αντίστασης του χαλκού γίνεται διπλάσια
από την τιμή, που έχει σε 0°C; Ισχύει το ίδιο για όλους τους χάλκινους αγωγούς,
ανεξάρτητα από τη μορφή και το μέγεθός τους;
Ισχύει το ίδιο για αγωγούς, που είναι από διαφορετικό υλικό;
Δίνεται ο θερμικός συντελεστής αντίστασης α Cu = 3,9·10^-3 grad^-1 .
"""

# Δεδομένα
C = 0  # Θερμοκρασία σε oC
a = 3.9 * 10 ** (-3)  # θερμικός συντελεστής αντίστασης Cu σε grad^-1

print()
print('Από την σχέση ρ=ρ0(1+α*θ) πρέπει 2*ρ0=ρ0(1+α*θ) => α*θ=1 => θ=1/α άρα:')
θ = 1 / a
print('θ={:.2f} οC.'.format(θ))
