#!/usr/bin/python3
# filename 2_9.py
"""
Άσκηση 2.9

Στα άκρα ενός σύρματος εφαρμόζουμε σταθερή συνεχή τάση και διαπιστώνουμε
ότι σε θερμοκρασία θ1 = 20°C η ένταση του ρεύματος, που διαρρέει
το σύρμα είναι I1 = 2Α, ενώ σε θερμοκρασία θ2 = 2520°C η ένταση
του ρεύματος είναι I = 1Α.
Να βρεθεί ο θερμικός συντελεστής αντίστασης του υλικού του σύρματος.
"""

# Δεδομένα
θ1 = 20  # Θερμοκρασία σε oC
θ2 = 2520  # Θερμοκρασία σε oC
I1 = 2  # Ένταση ρεύματος σε Α
I2 = 1  # Ένταση ρεύματος σε Α

print()
print('Από την σχέση R1=ρ(1+α*θ1) και R2=ρ(1+α*θ2) έχουμε:')
print('R1/R2 = (1+α*θ1)/(1+α*θ2)  (1)')
print('Επίσης  V=I1*R1 και V=I2*R2 δηδλαδή R1/R2 = I2/Ι1  (2)  άρα')
print('από (1) και (2) => α=(I2-I1)/(I2*θ2-I1*θ1)')
α = (I1 - I2) / (I2 * θ2 - I1 * θ1)
print('α={:.2e} grad^(-1).'.format(α))
