#!/usr/bin/python3
# filename 3_1.py
"""
Άσκηση 3.1

Σε ένα πείραμα μέτρησης της ταχύτητας του φωτός με τη
μέθοδο του Fizeau η απόσταση μεταξύ της φωτεινής πηγής
και του κατόπτρου είναι 12945m και ο τροχός έχει 720 διάκενα.
Να υπολογίσετε την ελάχιστη συχνότητα περιστροφής του
τροχού αυτού, αν η πειραματική ταχύτητα του φωτός που
προέκυψε ήταν 2,982x108m/s.
"""

# Δεδομένα
l = 12945               # Απόσταση σε m
N = 720                 # Αριθμός διακένων
c = 2.982 * 10**8       # Ταχύτητα σε m/sec


print()
print('Από την μέτρηση του Fizeau, έχουμε: c = 2 * l * N * f, όπου f η  συχνότητα, άρα: \n'
      'f = c / (2 *l * N)')
f = c / (2 *l * N)
print(f'Η ελάχιστη συχνότητα του τροχού είναι: {f:.2f} Hz')