#!/usr/bin/python3
# filename 3_10.py
"""
Άσκηση 3.10

Αν υποθέσουμε ότι το ανθρώπινο μάτι μπορεί να αισθανθεί φως
μήκους κύματος λ=600nm όταν προσπίπτουν σ’ αυτό τουλάχιστον
100 φωτόνια ανά δευτερόλεπτο, να υπολογίσετε:

α. τη συχνότητα του κύματος.
β. την ολική ενέργεια ανά δευτερόλεπτο που δέχεται το μάτι.

"""


# Δεδομένα
λ = 600 * 10**(-9)      # Μήκος κύματος σε m
h = 6.63 * 10**(-34)    # Σταθερά Planck σε J*sec
t = 1                   # Χρόνος σε sec
N = 100                 # Αριθμός φωτονίων
c = 3 * 10**8           # Ταχύτητα του φωτός σε m/sec.

print()
print('α) Η συχνότητα του κύματος δίνεται από την σχέση: f = c / λ, άρα: \n'
      '   f = ', end='')
f = c / λ
print(f'{(f/(10**12)):.2f} THz')

print('β) Η ολική ενέργεια ανά δευτερόλεπτο που δέχεται το μάτι είναι:\n'
     f'   E = N * h * f => E = {(N * h * f):.3e} J')