#!/usr/bin/python3
# filename 3_11.py
"""
Άσκηση 3.11

Μονοχρωματικό φως μήκους κύματος λo=600nm, που διαδίδεται
στον αέρα εισέρχεται ταυτόχρονα σε δύο οπτικά υλικά πάχους
1m, κάθετα στην διαχωριστική επιφάνεια του κάθε υλικού με
τον αέρα. Οι δείκτες διάθλασης των δύο υλικών είναι n1=1.5
και n2=1.2. Να βρείτε:

α. τη χρονική διαφορά εξόδου του φωτός από τα δύο οπτικά υλικά.
β. τον αριθμό των μηκών κύματος του φωτός σε κάθε οπτικό υλικό.

"""


# Δεδομένα
λο = 600 * 10**(-9)     # Μήκος κύματος σε m
d = 1                   # Πάχος υλικών σε m
n1 = 1.5                # Δείκτης διαθλασης
n2 = 1.2                # Δείκτης διαθλασης
c = 3 * 10**8           # Ταχύτητα του φωτός σε m/sec.

print()
print('α) Η ταχύτητα του κύματος στο ένα υλικό είναι c1 = c / n1 \n'
     f'   άρα: c1 = ', end='')
c1 = c / n1
print(f'{c1:.2e} m/sec')
print('   και θα διανύσει την απόσταση d σε χρόνο t1 = d / c1 = ', end='')
t1 = d / c1
print(f'{t1} sec')

print()

print('   Η ταχύτητα του κύματος στο άλλο υλικό είναι c2 = c / n2 \n'
     f'   άρα: c2 = ', end='')
c2 = c / n2
print(f'{c2:.2e} m/sec')
print('   και θα διανύσει την απόσταση d σε χρόνο t2 = d / c2 = ', end='')
t2 = d / c2
print(f'{t2} sec')
print(f'  Συνεπώς θα εξέλθουν με διαφορά dt = t1-t2 = {t1-t2:.2e} sec')

print()
print('β) Το μήκος του κύματος στο ένα υλικό είναι λ1 = λο / n1 \n'
     f'   άρα: λ1 = ', end='')
λ1 = λο / n1
print(f'{λ1:.2e} m')

print('   Το μήκος του κύματος στο άλλο υλικό είναι λ2 = λο / n2 \n'
     f'   άρα: λ2 = ', end='')
λ2 = λο / n2
print(f'{λ2:.2e} m')
