#!/usr/bin/python3
# filename 3_2.py
"""
Άσκηση 3.2

Μία δέσμη φωτός που διαδίδεται στο κενό έχει μήκος κύματος 600nm:
(α) Να υπολογίσετε την ταχύτητα διάδοσης αυτής της δέσμης σε γυαλί με δείκτη
διάθλασης 1,6.
(β) Ποια τιμή έχει το μήκος κύματος της δέσμης, όταν αυτή διαδίδεται στο γυαλί;
Δίνεται ότι η ταχύτητα του φωτός στο κενό είναι 300000km/s.
"""

# Δεδομένα
λο = 600 * 10**(-9)      # Μήκος κύματος σε m
n = 1.6                 # Δείκτης διάθλασης
Co = 3 * 10**8           # Ταχύτητα σε m/sec


print()
print('α) Ο δείκτης διάθλασης ορίζεται ως το πηλίκο της ταχύτητας του φωτός στο κενό \n'
      '   προς την ταχύτητα του φωτός στο μέσο, δηλ. n = Co / C => C = Co / n  =>')

C = Co / n
print(f'H ταχύτητα διάδοσης της δέσμης σε γυαλί  είναι: {C:.3e} m/sec')
print()

print('β) Ισχύει επίσης ότι ο δείκτης διάθλασης ισούται: n = λο / λ , όπου λ ο δείκτης \n'
      '   διάθλασης στο γυαλί. Άρα: λ = λο / n => ', end='')
λ = λο / n
print(f'λ={λ} m')