#!/usr/bin/python3
# filename 3_4.py
"""
Άσκηση 3.4

Φως έχει μήκος κύματος 560nm στο κενό. Όταν διαδίδεται στο νερό, έχει
ταχύτητα 2,25x10 8 m/s. Αν το φως αυτό διαδιδόταν στο νερό, ποιο θα ήταν τότε
το μήκος κύματός του; Δίνεται ότι η ταχύτητα στο κενό είναι 3x10 8 m/s.
"""

# Δεδομένα
λο = 560 * 10**(-9)           # Μήκος κύματος στο κενό σε m
Cν = 2.25 * 10**8             # Ταχύτητα στο νερό σε m/sec
Co = 3 * 10**8                # Ταχύτητα στο κενό σε m/sec


print()
print('Ο δείκτης διάθλασης στο νερό  είναι:\tCν = λν * f \t(1), όπου f η συχνότητα.\n'
      'ο δείκτης διάθλασης στο κενό  είναι:\tCο = λο * f \t(2)')
print('Από τις σχέσεις (1) και (2) => Co / Cν = λο / λν => λν = λο * Cν / Co =>')
λν = λο * Cν / Co
print(f'λν={λν:.2e} m')
