#!/usr/bin/python3
# filename 3_5.py
"""
Άσκηση 3.5

Φως που διαδίδεται στο κενό έχει μήκος κύματος λo . Όταν το ίδιο φως
διαδίδεται στην αιθανόλη, έχει μήκος κύματος 440nm και στη γλυκερίνη
405nm. Ποιος είναι ο λόγος του δείκτη διάθλασης της αιθανόλης προς το
δείκτη διάθλασης της γλυκερίνης σε μήκος κύματος λ0 ;
"""

# Δεδομένα
λαιθ = 440 * 10**(-9)         # Μήκος κύματος στην αιθανόλη  σε m
λγ = 405 * 10**(-9)           # Μήκος κύματος στην γλυκερίνη σε m



print()
print('Ο δείκτης διάθλασης Ναιθ στην αιθανόλη:\tNαιθ = λο / λαιθ \t(1), όπου λο το μήκος κύματος στο κενό.\n'
      'Ο δείκτης διάθλασης Νγ στην  γλυκερίνη:\t  Nγ = λο / λγ   \t(2)')
print('Από τις σχέσεις (1) και (2) => Nαιθ / Nγ = λγ / λαιθ => Nαιθ / Nγ =', end='')
print(f'{(λγ / λαιθ):.2f}')
