#!/usr/bin/python3
# filename 3_7.py
"""
Άσκηση 3.7

Μονοχρωματική δέσμη φωτός που διαδίδεται στο νερό προσπίπτει σε γυάλινο
κύβο, ο οποίος είναι βυθισμένος εξ ολοκλήρου στο νερό, υπό γωνία πρόσπτωσης
50°. Ένα μέρος της δέσμης ανακλάται, ενώ το άλλο διαθλάται. Αν η γωνία
διάθλασης και η γωνία ανάκλασης έχουν άθροισμα 90°, να υπολογίσετε το
δείκτη διάθλασης του γυάλινου κύβου για το φως αυτό, αν ο δείκτης διάθλασης
του νερού είναι 1,333.
"""

from math import tan, radians

# Δεδομένα
θp = 50         # Γωνία πρόσπτωσης σε °
nν = 1.333      # Δείκτης διάθλασης του νερού
print()
print('Όταν η γωνία διάθλασης και η γωνία ανάκλασης έχουν άθροισμα 90° τότε η \n'
      'ανακλώμενη δέσμη είναι πλήρως πολωμένη. Ισχύει λοιπόν:\n'
      'nγ / nν = tan(θp) => nγ = nν * tan(θp) => nγ = ', end='')
nγ = nν * tan(radians(θp))
print(f'{nγ:.3f}')