#!/usr/bin/python3
# filename 3_8.py
"""
Άσκηση 3.8

Μονοχρωματική δέσμη φυσικού φωτός που διαδίδεται στον αέρα προσπίπτει
στη λεία επιφάνεια ενός κρυστάλλου χαλαζία υπό γωνία 57° (ως προς την
κάθετο στο σημείο πρόσπτωσης). Η ανακλώμενη δέσμη βρέθηκε ότι είναι
ολικώς πολωμένη:
(α) Πόσος είναι ο δείκτης διάθλασης του χαλαζία;
(β) Πόση είναι η γωνία διάθλασης;
"""

from math import tan, radians

# Δεδομένα
θp = 57         # Γωνία πρόσπτωσης σε °


print()
print('α) Επειδή η ανακλώμενη δέσμη είναι ολικώς πολωμένη, ισχύει ο νόμος του\n'
     f'   Brewster: n = tan(θp) ή n = tan({θp}) ή n = ', end='')
n = tan(radians(θp))
print(f'{n:.3f}')
print()

print('β) Όταν η ανακλώμενη γωνία είναι πλήρως πολωμένη, τότε η γωνία διάθλασης \n'
     f'   και η γωνία ανάκλασης έχουν άθροισμα 90°. Άρα:\n'
     f'   θ2 + θp = 90 ή θ2 = 90-{θp} ={90-θp} °.')