#!/usr/bin/python3
# filename 3_09.py
"""
Άσκηση 3.9

Ένας ραδιοφωνικός σταθμός εκπέμπει ηλεκτρομαγνητικό κύμα συχνότητας 100MHz.

α. Πόση είναι η ενέργεια ενός φωτονίου αυτής της ακτινοβολίας;
β. Να συγκρίνετε το αποτέλεσμα με την ενέργεια κάποιας ορατής ακτινοβολίας
   π.χ. του κίτρινου φωτός, μήκους κύματος 600nm στο κενό.
γ. Να βρείτε τον αριθμό των φωτονίων που εκπέμπονται ανά δευτερόλεπτο, αν
   η ισχύς που ακτινοβολείται είναι 6,63 kW.
"""


# Δεδομένα
f = 100 * 10**6         # Συχνότητα κύματος σε Hz
h = 6.63 * 10**(-34)    # Σταθερά Planck σε J*sec
P = 6.63 * 10**3        # Ισχύς σε KW
t=1                     # Χρόνος σε sec

print()
print('α) Κάθε φωτόνιο μιας ακτινοβολίας έχει ενέργεια που δίνεται από τη σχέση:\n'
      '   Ef = h * f, άρα: E = ', end='')
Ef = h * f
print(f'{Ef} J')

print()
print('β) Η ενέργεια που ακτινοβολείται είναι E = P * t, όπου P η ισχύς και t ο χρόνος, άρα:\n'
      '   E = ',end='')
E = P * t
print(f'{E} J')

print(f'Συνεπώς ο αριθμός των φωτονίων είναι E / Ef = {(E / Ef):.3e}')