#!/usr/bin/python3
# Filename: 1_12.py
'''Άσκηση 12:

Στα σημεία Α και Β ευθείας (ε), που απέχουν απόσταση d = 0,3m, τοποθετούμε φορτία +2μC και +8μC αντίστοιχα.
Α. Σε ποιο σημείο της ευθείας η ένταση του πεδίου είναι μηδέν;
Β. Σε ποιο σημείο της ευθείας η ένταση μηδενίζεται αν το φορτίο +8μC αντικατασταθεί από φορτίο -8μC;
'''
from const import k
from math import sqrt

# Δεδομένα

Q1 = 2 * 10 ** (-6)  # φορτίο Q1 σε C.
Q2 = 8 * 10 ** (-6)  # φορτίο Q2 σε C.
d = 0.3  # Απόσταση φορτίων σε m.

print('**************************************************************')
print('Α. Σε ποιο σημείο της ευθείας η ένταση του πεδίου είναι μηδέν;')
print('**************************************************************\n')
print('Το φορτίο Q1 που βρίσκεται στο σημείο Α, δημιουργεί πεδίο Ε1.')
print('Το φορτίο Q2 που βρίσκεται στο σημείο Β, δημιουργεί πεδίο Ε2.')
print(
    'Επειδή τα φορτία είναι ομόσημα, το σημείο στο οποίο η ένταση του πεδίου είναι μηδέν \nβρίσκεται εντός του ευθύγραμμου τμήματος ΑΒ.')
print('Για την ένταση του φορτίου Q1 έχουμε E1=k*|Q1|/r1^2')
print('Για την ένταση του φορτίου Q2 έχουμε E2=k*|Q2|/r1^2')
print('Στο σημείο που μηδενίζεται το πεδίο θα ισχύει Ε1=Ε2')
print('Άρα:')
r1 = d * sqrt(Q1) / (
            sqrt(Q1) + sqrt(Q2))  # είναι η απόσταση από το σημείο Α (φορτιο Q1) στην οποία μηδενίζεται το πεδίου

print('Η απόσταση από το σημείο Α που βρίσκεται το φορτιο Q1, στην οποία μηδενίζεται το πεδίου είναι:', r1, 'm.')

print()
print('**************************************************************')
print('B. Σε ποιο σημείο της ευθείας η ένταση μηδενίζεται αν το φορτίο +8μC αντικατασταθεί από φορτίο -8μC;')
print('**************************************************************\n')
print('Το φορτίο Q1 που βρίσκεται στο σημείο Α, δημιουργεί πεδίο Ε1.')
print('Το φορτίο Q2 που βρίσκεται στο σημείο Β, δημιουργεί πεδίο Ε2.')
print(
    'Επειδή τα φορτία είναι ετερόσημα, το σημείο στο οποίο η ένταση του πεδίου είναι μηδέν \nβρίσκεται εκτός του ευθύγραμμου τμήματος ΑΒ και στην πλευρά του μικρότερου, δηλαδή στην πλευρά του Α.')
print('Για την ένταση του φορτίου Q1 έχουμε E1=k*|Q1|/r1^2')
print('Για την ένταση του φορτίου Q2 έχουμε E2=k*|Q2|/r1^2')
print('Στο σημείο που μηδενίζεται το πεδίο θα ισχύει Ε1=Ε2')
print('Άρα:', )
r2 = d * sqrt(Q1) / (
            sqrt(Q2) - sqrt(Q1))  # είναι η απόσταση από το σημείο Α (φορτιο Q1) στην οποία μηδενίζεται το πεδίου
print('Η απόσταση αριστερα από το σημείο Α που βρίσκεται το φορτιο Q1, στην οποία μηδενίζεται το πεδίου είναι:', r2,
      'm.')
