#!/usr/bin/python3
#Filename: 1_13.py
'''Άσκηση 13:

Δύο ηλεκτρικά φορτία βρίσκονται σε απόσταση d = 6m. Αν τα
φορτία είναι ίσα με:
Α. +4μC, Β. -4μC,
να υπολογιστεί η ένταση του πεδίου σε σημείο (Σ) της μεσοκάθετης
στην απόσταση d, που απέχει 3m από το μέσο της απόστασης d.

'''

from const import k
from math import sqrt

#Δεδομένα

Q1= 4*10**(-6)               #Α. φορτίο Q1 σε C.
Q2=-4*10**(-6)               #Α. φορτίο Q2 σε C.
d=6                          #Απόσταση φορτίων σε m.
x=3                          #Απόσταση μεσοκάθετου σε m.
print('****************')
print('A. +4mC')
print('****************')
print('H ένταση στο σημείο Σ υπολογίζεται από τη συνισταμένη των δύο εντάσεων που δημιουργούν τα φορτία, τα οποία επειδή είναι ίσα δημιουργούν ίσου μέτρου εντάσεις στο Σ.')
AS=sqrt((d/2)**2+ (d/2)**2)
print('Επειδή το σημείο Σ της μεσοκαθέτου απέχει {:.2f} m από το μέσο της απόστασης d, με το πυθαγόρειο θεώρημα προκύπτει\n ΑΣ=√((d/2)^2+(d/2)^2)={:.3} m.'.format(x, AS))
E1=k*abs(Q1)/AS**2
print('Το μέτρο των εντάσεων είναι: E1=E2=k*|Q1|/(ΑΣ^2) = {:.2f} N/C.'.format(E1))

print('Το μέτρο της συνισταμένης Εολ με βάση το πυθαγόρειο θεώρημα θα είναι Εολ=Ε1√2={:.2f} N/C.'.format(E1*sqrt(2)))
print()



print('****************')
print('Β. -4mC')
print('****************')
print('Στην περίπτωση φορτίων Q=-4mC, Η συνισταμένη ένταση έχει το ίδιο μέτρο με την περίπτωση Α αλλά αντίθετη φορά.')
