#!/usr/bin/python3
#Filename: 1_14.py
'''Άσκηση 14:

Μικρός μεταλλικός δίσκος έχει βάρος 32⋅10−3N και ισορροπεί σε μικρό ύψος από την επιφάνεια της Γης.
Κοντά στην επιφάνεια της Γης εμφανίζεται ηλεκτροστατικό πεδίο, έντασης Ε = 100Ν/C, κατακόρυφο και με φορά προς τα κάτω.
Να βρεθεί το είδος και η ποσότητα του ηλεκτρικού φορτίου που έχει ο δίσκος.

'''

#Δεδομένα

W= 32*10**(-3)                 #Βάρος δίσκου σε Ν.
E=100                        #Ένταση πεδίου σε Ν/C


print('****************')
print('Για να ισορροπεί το σώμα, σημαίνει ότι μια άλλη δύναμη F ασκείται σε αυτό με φορά αντίθετη του βάρους,\nέτσι ώστε η συνισταμένη των δυνάμεων να είναι μηδέν.')
print('Tο μέτρο της έντασης του πεδίου είναι: E=F/q')
q=W/E
print('και το φορτίο q=F/E και επειδή F=W έχουμε: \nq=W/E={:2e} N.'.format(q))
