#!/usr/bin/python3
#Filename: 1_15.py
'''Άσκηση 15:

Δύο όμοια μεταλλικά σφαιρίδια έχουν το καθένα βάρος 0,45Ν και είναι στερεωμένα στις άκρες δύο, ίσου μήκους, μεταξωτών νημάτων.
Τα νήματα έχουν μήκος 0,20m. Αν τα δύο σφαιρίδια έχουν ίσα φορτία, να βρεθεί το φορτίο καθενός, ώστε να ισορροπούν,
με τα νήματα κάθετα μεταξύ τους.

'''
from const import k
from math import sqrt

#Δεδομένα
B= 0.45                      #Βάρος σφαιριδίων σε Ν.
l=0.2                       #Μήκος νήματος σε m.


print('****************')
print(' Στη θέση ισορροπίας ασκούνται οι δυνάμεις όπως στο σχήμα. Λόγω ισορροπίας ισχύουν:')
print('Συνισταμένη των δυνάμεων στον άξονα x είναι μηδεν.\t ΣFx=0  <=> Fc = Tx')
print('Συνισταμένη των δυνάμεων στον άξονα y είναι μηδεν.\t ΣFy=0  <=> B  = Ty')
print('Επειδή θ =45° =>εφ(θ)=1')
print('Επομένως:')
print('k*|Q|² / (r²)= B =>|Q|= √(B*r²/k)')
print('όμως η απόσταση r₂ = (AB)*2 = 2*l')
Q=sqrt(2*B*l**2/k)
print('\nΆρα το φορτίο της κάθε σφαίρας είναι Q={:.2e} C'.format(Q))
