#!/usr/bin/python3
# Filename: 1_16.py
'''Άσκηση 16:

Στις κορυφές ΑΒΓΔ τετραγώνου, πλευράς 0,1m, τοποθετούνται
αντίστοιχα τα φορτία: +100μC, -200μC, +97μC, -196μC. Να υπο-
λογίσετε την ένταση του πεδίου στο κέντρο του τετραγώνου.

'''
from const import k
from math import sqrt

# Δεδομένα
Q1 = 100 * 10 ** (-6)  # φορτίο Q1 σε C.
Q2 = -200 * 10 ** (-6)  # φορτίο Q2 σε C.
Q3 = 97 * 10 ** (-6)  # φορτίο Q3 σε C.
Q4 = -196 * 10 ** (-6)  # φορτίο Q4 σε C.
l = 0.1  # πλευρά τετραγώνου σε m.

print('****************')
r = sqrt(l ** 2 + l ** 2) / 2
print('Το κέντρο του τετραγώνου απέχει από κάθε κορυφή απόσταση r=( √(l²+l²) ) / 2 = {:.2f}m'.format(r))
ΕΑ = k * abs(Q1) / r ** 2
print('Το φορτίο Q1 δημιουργεί ένα ηλεκτροστατικό πεδίο έντασης ΕΑ=k*|Q1|/r²={:.2e} N/C'.format(ΕΑ))
print()
ΕΒ = k * abs(Q2) / r ** 2
print('Ομοίως, Το φορτίο Q2 δημιουργεί ένα ηλεκτροστατικό πεδίο έντασης ΕΒ=k*|Q2|/r²={:.2e} N/C'.format(ΕΒ))
print()
ΕΓ = k * abs(Q3) / r ** 2
print('Ομοίως, Το φορτίο Q3 δημιουργεί ένα ηλεκτροστατικό πεδίο έντασης ΕΓ=k*|Q3|/r²={:.2e} N/C'.format(ΕΓ))
print()
ΕΔ = k * abs(Q4) / r ** 2
print('Ομοίως, Το φορτίο Q4 δημιουργεί ένα ηλεκτροστατικό πεδίο έντασης ΕΔ=k*|Q4|/r²={:.2e} N/C'.format(ΕΔ))

print('Υπολογίζουμε τη συνισταμένη με διεύθυνση (ΑΓ):ΕΑ-ΕΓ={:.2e} N/C'.format(ΕΑ - ΕΓ))
print('Υπολογίζουμε τη συνισταμένη με διεύθυνση (ΒΔ):ΕΒ-ΕΔ={:.2e} N/C'.format(ΕΒ - ΕΔ))
print('Και επομένως η συνισταμένη ένταση έχει μέτρο:')
Εολ = sqrt((ΕΑ - ΕΓ) ** 2 + (ΕΒ - ΕΔ) ** 2)
print('Eολ=√(ΕΑΓ²-ΕΒΔ²) ή Εολ={:.2e} N/C'.format(Εολ))
print('και γωνία εφθ=ΕΑΓ/ΕΒΔ => εφθ={:.2f}'.format((ΕΑ - ΕΓ) / (ΕΒ - ΕΔ)))
