#!/usr/bin/python3
#Filename: 1_17.py
'''Άσκηση 17:

Σωματίδιο με μάζα 1,0⋅10−5kg και φορτίο +1μC αφήνεται να κινηθεί σε ένα ομογενές ηλεκτρικό πεδίο έντασης 12Ν/C. Να βρεθούν:
Α. Η μετατόπισή του μετά από χρόνο 1s.
Β. Η κινητική του ενέργεια στο τέλος του πρώτου δευτερολέπτου της κίνησης.
Γ. Ποιες μετατροπές ενέργειας συνέβησαν.
'''
from const import k
from math import sqrt

#Δεδομένα
Q1= 1*10**(-6)              #φορτίο Q1 σε C.
E= 12                       #Ένταση του ηλεκτρικού πεδίου Ν/C.
m=1*10**(-5)                #Η μάζα του σωματιδίου σε Kg.
t=1                         #χρόνος t=1sec

print('-----A.Ερώτημα------')

print('Το σωματίδιο επειδή βρίσκεται στο ομογενές ηλεκτρικό πεδίο θα κινηθεί επιταχυνόμενα.')
print('Έστω ότι η μετατόπισή του μετά από t=1sec είναι x, τότε ισχύει x=(1/2)*a*t² (1), όπου a είναι η επιτάχυνσή του')
print('Ισχύει επίσης οτι η συνισταμένη των δυνάμεων που ασκούνται στο σωματίδιο ΣF=m*a')
print('Η μόνη δύναμη που ασκείται όμως στο σωματίδιο είναι η δύναμη Coulomb, Fc=m*a <=> E*|Q1|=m*a  (2)')
a=E*abs(Q1)/m
print('Άρα, έχουμε a={:.2e} m/sec²'.format(a))
print()
x=(1/2)*a*t
print('από την σχέση (1) προκύπτει x={:.2e} m'.format(x))
print('\n')

print('-----B.Ερώτημα------')
u=a*t
print('Η κινητική του ενέργεια δίνεται από την σχέση Ek=(1/2)*m*u² (3) όπου u: η τατύτητα του σε χρόνο t και ισχύει u=a*t \nάρα: u={:.2e}'.format(u))
Ek=(1/2)*m*u**2
print()
print('από την σχέση (3) προκύπτει Εκ={:.2e} Joule'.format(Ek))


