#!/usr/bin/python3
#Filename: 1_18.py
'''Άσκηση 18:

Σωματίδιο με μάζα 1,0⋅10−5kg και φορτίο +1μC αφήνεται να κινηθεί σε ένα ομογενές ηλεκτρικό πεδίο έντασης 12Ν/C. Να βρεθούν:
Α. Η μετατόπισή του μετά από χρόνο 1s.
Β. Η κινητική του ενέργεια στο τέλος του πρώτου δευτερολέπτου της κίνησης.
Γ. Ποιες μετατροπές ενέργειας συνέβησαν.

Με βάση το προηγούμενο πρόβλημα και μετά από 1s κίνησης,
εφαρμόζουμε συγχρόνως και ένα αντίρροπο ομογενές ηλεκτρικό πεδίο.
Να βρεθεί ποια θα έπρεπε να είναι η έντασή του, ώστε να
μηδενιστεί η ταχύτητα του σωματιδίου μετά από 1s.
'''
from const import k
from math import sqrt

#Δεδομένα
Q1= 1*10**(-6)              #φορτίο Q1 σε C.
E= 12                       #Ένταση του ηλεκτρικού πεδίου Ν/C.
m=1*10**(-5)                #Η μάζα του σωματιδίου σε Kg.
t1=1                        #χρόνος t1=1sec
t2=1                        #χρόνος μέχρι να μηδενιστεί η ταχύτητα t2=1sec
a=E*abs(Q1)/m               #επιτάχυνση κατά την εφαρμογή του πρώτου ηλεκτρικού πεδίου
u=a*t1                       #ταχύτητα του σωαμτιδίου μετά από χρόνο t1

print('-----------------------------------')

print('Όταν εφαρμόζουμε το αντίρροπο ηλεκτρικό πεδίο το σωματίδιο έχει ήδη ταχύτητα u={:0.2f}m/sec'.format(u))
print('και ασκείται πάνω του μια αντίρροπη δύναμη που τείνει να επιβραδύνει το σώμα')
print('Μετά απο χρόνο t2=1sec, το σωματίδιο θα σταματήσει, θα έχουμε δηλαδή 0=u-(a2)*(t2)²')
a2=u/t2**2
print('άρα a2=u/t2²={:0.2f}m/sec²'.format(a2))
print()
print('Από τον νόμο του Νεύτωνα, έχουμε ΣF=-m*a2 => F1-F2=-m*a2 =>|Q1|*(E-E2)=-m*a2 => E2 = E+m*a2/Q1  άρα\n')
E2 = E+m*a2/Q1
print('E2={:.2f} N/C'.format(E2))
