#!/usr/bin/python3
#Filename: 1_19.py
'''Άσκηση 19:

Δύο ηλεκτρικά φορτία +4μC και -6μC βρίσκονται σε απόσταση
0,4m. Να υπολογιστεί η δυναμική ενέργεια του συστήματος των
φορτίων.
'''
from const import k
from math import sqrt

#Δεδομένα
Q1= 4*10**(-6)              #φορτίο Q1 σε C.
Q2=-6*10**(-6)              #φορτίο Q2 σε C.
r=0.4                       #απόσταση σε m.

print('-----------------------------------')
print('Η δυναμική ενέργεια του συστήματος δίνεται από τη σχέση: U = k*Q1*Q2/r')
print('Άρα:\n')
U = k*Q1*Q2/r
print('U = {:.2f} Joule'.format(U))
