#!/usr/bin/python3
#Filename:1_2.py

'''
Άσκηση 2:
Δίνονται δύο σημειακά φορτία -0,04μC.
Να υπολογίσετε τη δύναμη που ασκείται από το ένα φορτίο στο
άλλο, αν η απόστασή τους είναι:
Α. 3cm
Β. 6cm
'''
from const import *

#δεδομενα

q=-0.04*10**(-6)   #φορτίο

r1=0.03 #απόσταση σε m
r2=0.06 #απόσταση σε m

# Η δύναμη μεταξύ των φορτίων δίνεται από το Νόμο του Coulomb:
#F=k*(q1*q2)/r^2

print("Εφαρμόζοντας τον νόμο του Coulomb έχουμε:")

print('Α. Για απόσταση {} cm, η δύναμη που ασκείται είναι F1={:.2e} Ν'.format(r1, k*(q*q)/r1**2))
print('Β. Για απόσταση {} cm, η δύναμη που ασκείται είναι F2={:.2e} Ν'.format(r2, k*(q*q)/r2**2))
