#!/usr/bin/python3
#Filename: 1_20.py
'''Άσκηση 20:

Το σύστημα δύο ηλεκτρικών φορτίων +3μC και +4μC περιέχει
ενέργεια 0,27 Joule. Να βρεθεί η απόσταση μεταξύ των δύο φορ-
τίων.
'''
from const import k
#Δεδομένα
Q1=3*10**(-6)              #φορτίο Q1 σε C.
Q2=4*10**(-6)              #φορτίο Q2 σε C.
U= 0.27                    #Ενέργεια σε joule.

print('-----------------------------------')
print('Η δυναμική ενέργεια του συστήματος δίνεται από τη σχέση: U = k*Q1*Q2/r')
print('Άρα, r = k*Q1*Q2/U\n')
r = k*Q1*Q2/U
print('r = {:.2f} m'.format(r))
