#!/usr/bin/python3
# Filename: 1_21.py
'''Άσκηση 21:

Φορτίο-πηγή +6μC δημιουργεί ηλεκτρικό πεδίο. Σε θέση που απέ-
χει 0,3m από το φορτίο τοποθετείται δοκιμαστικό φορτίο -6nC.
Πόση είναι η δυναμική ενέργεια του δοκιμαστικού φορτίου;
(1nC = 10-9C)

'''
from const import k

# Δεδομένα
Q1 = 6 * 10 ** (-6)  # φορτίο-πηγή  Q1 σε C.
Q2 = -6 * 10 ** (-9)  # Δοκιμαστικό φορτίο Q2 σε C.
r = 0.3  # Απόσταση φορτίων σε m.

print('-----------------------------------')
print('Η δυναμική ενέργεια του συστήματος δίνεται από τη σχέση: U = k*Q1*Q2/r')
print('Άρα:')
U = k * Q1 * Q2 / r
print('U = {:.3e} Joule'.format(U))
