#!/usr/bin/python3
#Filename: 1_25.py
'''Άσκηση 25:

Δύο σημειακά φορτία +2μC και +18μC απέχουν απόσταση 16cm.
Να βρεθεί:
Α. Σε ποιο σημείο μηδενίζεται η ένταση του πεδίου.
Β. Το δυναμικό στη θέση μηδενισμού της έντασης.
'''
from const import k
from math import sqrt
#Δεδομένα
Q1=2*10**(-6)              #φορτίο Q1 σε C.
Q2=18*10**(-6)             #φορτίο Q2 σε C.
d= 0.16                    #Απόσταση φορτίων σε m.

print('--------------A.--------------------')

print('Το φορτίο Q1 που βρίσκεται στο σημείο Α, δημιουργεί πεδίο Ε1.')
print('Το φορτίο Q2 που βρίσκεται στο σημείο Β, δημιουργεί πεδίο Ε2.')
print('Επειδή τα φορτία είναι ομόσημα, το σημείο στο οποίο η ένταση του πεδίου είναι μηδέν \nβρίσκεται εντός του ευθύγραμμου τμήματος ΑΒ.')
print('Για την ένταση του φορτίου Q1 έχουμε E1=k*|Q1|/r1^2')
print('Για την ένταση του φορτίου Q2 έχουμε E2=k*|Q2|/r1^2')
print('Στο σημείο που μηδενίζεται το πεδίο θα ισχύει Ε1=Ε2')
print('Άρα:')
x=d*sqrt(Q1)/(sqrt(Q1)+sqrt(Q2)) #είναι η απόσταση από το σημείο Α (φορτιο Q1) στην οποία μηδενίζεται το πεδίου

print('Η απόσταση x από το σημείο Α που βρίσκεται το φορτιο Q1, στην οποία μηδενίζεται το πεδίου είναι: x=',x,'m.' )
print()
print('--------------B.--------------------')


print('Στο σημείο που μηδενίζεται η ένταση το δυναμικό Va που οφείλεται στο φορτίο Q1 είναι Va=k*Q1/x')
Va=k*Q1/x
print('Va={:.2e} V'.format(Va))
print()


print('Στο σημείο που μηδενίζεται η ένταση το δυναμικό Vb που οφείλεται στο φορτίο Q2 είναι Vb=k*Q2/(d-x)')
Vb=k*Q2/(d-x)
print('Vb={:.2e} V'.format(Vb))
print()

print('Το συνολικό δυναμικό προκύπτει από το αλγεβρικό άθροισμα των επιμέρους δυναμικών Va και Vb, άρα:\n Vol=Va+Vb={:.2e} V'.format(Va+Vb))
