#!/usr/bin/python3
# Filename: 1_26.py
'''Άσκηση 26:

Ακίνητο σημειακό φορτίο +2μC βρίσκεται σε σημείο «Σ».
Α. Να υπολογιστεί το δυναμικό σε απόσταση r1=2m και r2=4m από το (Σ).
Β. Αν σημειακό φορτίο q = 1μC τοποθετηθεί σε απόσταση r1  ποια η δυναμική του ενέργεια;
Γ. Αν το φορτίο q = 2μC μετακινηθεί από τη θέση r1 στη θέση r2, ποιο είναι το έργο της δύναμης του πεδίου; Το έργο αυτό εξαρτάται από τη διαδρομή που θα ακολουθήσει το φορτίο q;
'''
from const import k

# Δεδομένα
Q = 2 * 10 ** (-6)  # φορτίο Q σε C.
r1 = 2  # Απόσταση r1 σε m.
r2 = 4  # Απόσταση r2 σε m.
q = 1 * 10 ** (-6)  # φορτίο q σε C.
q2 = 2 * 10 ** (-6)  # φορτίο q2 σε C.

print('--------------A.--------------------')
print('Το δυναμικό σε απόσταση r, δίνεται από τη σχέση: V =U/q => V= k*Q/r ')
print('Άρα:')
V1 = k * Q / r1
print('Σε απόσταση r1 έχουμε V1={:.2e} V'.format(V1))
V2 = k * Q / r2
print('Σε απόσταση r2 έχουμε V2={:.2e} V'.format(V2))
print()

print('--------------B.--------------------')
print('H δυναμική ενέργεια δίνεται από την σχέση: U=k*Q*q/r1  ')
print('Άρα:')
U = k * Q * q / r1
print('U = {:.2e} Joule'.format(U))
print()

print('--------------Γ.--------------------')
print('Το έργο της δυναμης του πεδίου από το σημείο r1 στο σημείο r2 δίνεται από την σχέση: W(r1->r2)=k*(V1-V2)')
print('Άρα:')
W = q2 * (V1 - V2)
print('U = {:.2e} Joule'.format(W))
