#!/usr/bin/python3
#Filename: 1_28.py
'''Άσκηση 28:

Τέσσερα ηλεκτρικά φορτία +30μC, -60μC, +90μC και -120μC βρί-
σκονται αντίστοιχα στις κορυφές Α, Β, Γ, Δ τετραγώνου, πλευράς 5√2m.
Να υπολογίσετε:
Α. Το δυναμικό στο μέσο «Μ» της πλευράς (ΑΒ).
Β. Το δυναμικό στο κέντρο του τετραγώνου «Κ».
Γ. Το έργο της δύναμης του πεδίου κατά τη μεταφορά φορτίου
   q = 10^-9 C από τη θέση «Μ» στη θέση «Κ». Ποιο είναι το φυσικό
   περιεχόμενο του έργου αυτού;

'''
from const import k         #ηλεκτροστατική σταθερά  N*m^2/C^2
from const import Qp        #φορτίο πρωτονίου Qp σε C.
from const import Qe        #φορτίο ηλεκτρονίου Qe σε C.
from const import Me        #Μάζα ηλεκτρονίου Μe σε Kg.
from math import sqrt


#Δεδομένα
Q1=30*10**(-6)              #φορτίο Q1 σε C.
Q2=-60*10**(-6)             #φορτίο Q2 σε C.
Q3=90*10**(-6)              #φορτίο Q3 σε C.
Q4=-120*10**(-6)            #φορτίο Q4 σε C.
q= 1*10**(-9)               #φορτίο q σε C.
d=5*sqrt(2)                 #μήκος πλευράς σε m.

print('--------------Α.--------------------')

ΒΜ=AM=d/2
print('Στο μέσο της πλευράς ΑΒ, έχουμε ΑΜ= ΜΒ= d/2 => AM = {:.2f}m'.format(AM))

ΓΜ=ΔΜ=sqrt(AM**2+d**2)
print('Η απόσταση ΓΜ και ΔΜ είναι ίσες. ΓΜ=ΔΜ = ( √(ΑΜ²+ΓΑ²) ) = {:.2f} m'.format(ΓΜ))

VAM=k*Q1/AM
print('Το φορτίο Q1 δημιουργεί στο σημείο Μ ένα δυναμικό VAM=k*Q1/AM={:.2e} V'.format(VAM))

VBM=k*Q2/ΒΜ
print('Το φορτίο Q2 δημιουργεί στο σημείο Μ ένα δυναμικό VBM=k*Q2/ΒΜ={:.2e} V'.format(VBM))

VΓM=k*Q3/ΓΜ
print('Το φορτίο Q3 δημιουργεί στο σημείο Μ ένα δυναμικό VΓM=k*Q1/ΓM={:.2e} V'.format(VΓM))

VΔM=k*Q4/ΔΜ
print('Το φορτίο Q4 δημιουργεί στο σημείο Μ ένα δυναμικό VΔM=k*Q4/ΔM={:.2e} V'.format(VΔM))


print('Το συνολικό δυναμικό είναι το αλγεβρικο άθροισμα των δυναμικών κάθε φορτίου:')
VM=VAM+VBM+VΓM+VΔM
print('VM=VAM+VBM+VΓM+VΔM =>VM = {:.2e} V'.format(VM))
print('\n\n')




print('--------------B.--------------------')

x=sqrt(d**2+d**2)/2
print('Το κέντρο του τετραγώνου απέχει από κάθε κορυφή απόσταση x=( √(d²+d²) ) / 2 = {:.2f}m'.format(x))
print()

V1=k*Q1/x
print('Το φορτίο Q1 δημιουργεί ένα δυναμικό V1=k*Q1/x={:.2e} V'.format(V1))

V2=k*Q2/x
print('Το φορτίο Q2 δημιουργεί ένα δυναμικό V2=k*Q2/x={:.2e} V'.format(V2))

V3=k*Q3/x
print('Ομοίως το φορτίο Q3 δημιουργεί ένα δυναμικό V3=k*Q3/x={:.2e} V'.format(V3))

V4=k*Q4/x
print('Ομοίως το φορτίο Q4 δημιουργεί ένα δυναμικό V4=k*Q4/x={:.2e} V'.format(V4))
print()

VK=V1+V2+V3+V4
print('Το δυναμικό στο κέντρο του τετραγώνου, είναι VK=V1+V2+V3+V4.={:.2e} V'.format(VK))


print('--------------Γ.--------------------')
print()
print('Το έργο της δύναμης του πεδίου για την μεταφορά του φοριου q από το σημείο Μ στο σημείο Κ, δινεται από την σχέση:')
print('W=(VM-VK)*q={:.2e} Joule'.format((VM-VK)*q))
