#!/usr/bin/python3
#Filename: 1_29.py
'''Άσκηση 29:

Στο πρόβλημα 28 να υπολογιστεί το έργο της δύναμης του ηλε-
κτρικού πεδίου κατά τη μετακίνηση φορτίου +1μC.
Α. Από τη θέση Μ στο άπειρο.
Β. Από τη θέση Κ στο άπειρο.
Ποιο συμπέρασμα βγάζετε σε κάθε μία περίπτωση;

'''
from const import k         #ηλεκτροστατική σταθερά  N*m^2/C^2
from const import Qp        #φορτίο πρωτονίου Qp σε C.
from const import Qe        #φορτίο ηλεκτρονίου Qe σε C.
from const import Me        #Μάζα ηλεκτρονίου Μe σε Kg.
from math import sqrt


#Δεδομένα
q=1*10**(-6)                #φορτίο q σε C.
VM =-1.11e+05               #Δυναμικό στο σημείο Μ
VΚ =-1.08e+05               #Δυναμικό στο σημείο Κ


print('--------------Α.--------------------')
print()
print('Το έργο της δύναμης του πεδίου για την μετακίνηση του φορτίου q από το σημείο Μ στο άπειρο,')
print('δίνεται από την σχέση:')
print('W=(VM-V∞)=(VM-0)*q {:.3f} Joule'.format(VM*q))
print()
print('--------------B.--------------------')
print()
print('Το έργο της δύναμης του πεδίου για την μετακίνηση του φορτίου q από το σημείο Κ στο άπειρο,')
print('δίνεται από την σχέση:')
print('W=(VΚ-V∞)=(VΚ-0)*q {:.3f} Joule'.format(VΚ*q))
print()

print('--------------G.--------------------')
print()
print('Και στις δύο περιπτώσεις απατείται η προσφορά έργου (αρνητικό πρόσημο έργου)')
