#!/usr/bin/python3
#Filename: 1_31.py
'''Άσκηση 31:

Κατά τη διάρκεια μιας καταιγίδας, νέφος στην επιφάνειά του προς
τη Γη εμφανίζει φορτίο -25C. Στην επιφάνεια της Γης, δημιουργού-
νται από επαγωγή θετικά φορτία. Όταν η διαφορά δυναμικού
μεταξύ νέφους - Γης φθάσει τα 5 · 10 7 V, ο ατμοσφαιρικός αέρας
παύει για λίγο να λειτουργεί ως μονωτής και ξεσπά ηλεκτρική εκ-
κένωση, κατά την οποία ηλεκτρόνια του νέφους κατευθύνονται
προς τη Γη (κεραυνός).
Α. Πόση ηλεκτρική ενέργεια απελευθερώθηκε;
Β. Πόση είναι η μέση ισχύς που αποδίδεται, αν η διάρκεια του
φαινομένου είναι 10 -3 s;
'''

#Δεδομένα

q=25                   #φορτίο q σε C.
V=5*10**(7)              #Διαφορά δυναμικού σε V
t=10**(-3)               #Χρόνος φαινομένου σε sec.

print('--------------A.------------------')
print()
print('Το συστημα νέφος-επιφάνεια γης μπορεί να θεωρηθεί "επίπεδος πυκνωτής"\
Η ηλεκτρική ενέργεια που ελευθερώθηκε κατά τη διάρκεια του κεραυνού, E=(1/2)*q*V , άρα:')
Ε=(1/2)*q*V
print('E={:.2e} Joule.'. format(Ε))
print()


print('--------------B.------------------')
print()
P=Ε/t
print('Η μέση ισχύς δίνεται από την σχέση: P=E/t => P={:.2e} Watt'.format(P))
