#!/usr/bin/python3
#Filename: 1_32.py
'''Άσκηση 32:

Πυκνωτής έχει χωρητικότητα C = 50μF. Πόση διαφορά δυναμικού
πρέπει να εφαρμοστεί μεταξύ των δύο οπλισμών του πυκνωτή,
για να αποκτήσει ηλεκτρικό φορτίο 10^-3 C; Πόση ενέργεια έχει τότε
ο πυκνωτής;
'''

#Δεδομένα
C=50*10**(-6)            #χωρητικότητα πυκωντή σε F.
Q=10**(-3)               #Φορτίο πυκνωτή σε C.

print()
V=Q/C
print('Από την σχέση C=Q/V => V=Q/C => V={:.2f} V'.format(V))
print()
E=(1/2)*Q*V
print('Η ενέργεια του πυκνωτή δίνεται από την σχέση Ε=(1/2)*Q*V => E={:.2f} Joule.'.format(E))
