#!/usr/bin/python3
#Filename: 1_33.py
'''Άσκηση 33:

Δύο φύλλα αργιλίου έχουν διαστάσεις 10cm × 20cm και απέχουν
απόσταση 0,5mm. Πόση είναι η χωρητικότητα του πυκνωτή;
'''
from const import e0 #H απόλυτη διηλεκτρική σταθερά του κενού

#Δεδομένα
d1=0.1              #Πλευρά φύλλου σε m.
d2=0.2              #Πλευρά φύλλου σε m.
l =5*10**(-4)        #απόσταση φύλλων σε m.

print()
S=d1*d2
print('To εμβαδό του οπλισμού είναι: S={:.2f} m²'.format(S))
print()
C=e0*S/l
print('Η χωρητικότητα του πυκνωτή είναι: C=e0*S/l => C={:.2} F'.format(C))
