#!/usr/bin/python3
# Filename: 1_35.py
'''Άσκηση 35:

O κάθε οπλισμός ενός επίπεδου πυκνωτή έχει εμβαδόν 0,2m2 ,
ενώ οι οπλισμοί του απέχουν 4mm. Να υπολογίσετε:
Α. Τη χωρητικότητα του πυκνωτή.
Β. Το φορτίο που αποκτά ο πυκνωτής, αν φορτισθεί με τάση 200V.
'''
from const import e0  # H απόλυτη διηλεκτρική σταθερά του κενού

# Δεδομένα
S = 0.2  # Εμβαδό οπλισμού σε m².
l = 4 * 10 ** (-3)  # απόσταση οπλισμών σε m.
V = 200  # Τάση σε V

print('---------------A.----------------')
print()
C = e0 * S / l
print('Η χωρητικότητα του πυκνωτή είναι: C=e0*S/l => C={:.2} F'.format(C))

print()
print('---------------B.----------------')
Q = C * V
print('Το φορτίο του πυκνωτή είναι: Q=C*V => Q={:.2} C'.format(Q))
