#!/usr/bin/python3
# Filename: 1_36.py
'''Άσκηση 36:

Ένας επίπεδος πυκνωτής έχει χωρητικότητα 2μF, απόσταση οπλισμών 2cm και
έχει φορτιστεί με τάση 150V. Στη συνέχεια απομακρύνουμε την πηγή φόρτισης
και διπλασιάζουμε την απόσταση των οπλισμών του.
Να υπολογιστούν οι τιμές πριν και μετά το διπλασιασμό:
Α. Της χωρητικότητας του πυκνωτή.
Β. Της τάσης μεταξύ των οπλισμών του.
Γ. Της έντασης του ηλεκτρικού πεδίου.
Δ. Της ενέργειας του ηλεκτρικού πεδίου.
Πώς εξηγείται η μεταβολή της ενέργειας του πυκνωτή;

'''

# Δεδομένα
C1 = 2 * 10 ** (-6)  # χωρητικότητα πυκνωτή σε F.
l1 = 2 * 10 ** (-2)  # απόσταση οπλισμών σε m.
l2 = 2 * l1  # απόσταση οπλισμών μετά τον διπλασιασμό σε m.
V1 = 150  # Τάση σε V
l2 = 2 * l1

print()
Q1 = C1 * V1
print('Το φορτίο του πυκνωτή δίνεται από την σχέση Q1=C1*V1 => Q1={:.2e} C'.format(Q1))
print()
print('---------------------------A.-------------------------------')
print('-ΠΡΙΝ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
print('Η χωρητικότητα του πυκνωτή είναι C1=e0*S/l1:             C1=' + str(C1) + ' F')
print('-ΜΕΤΑ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
C2 = C1 / 2
print('Η χωρητικότητα του πυκνωτή είναι C2=e0*S/2l1 =>C2=C1/2 =>C2={:.0e} F'.format(C2))

print()
print('---------------------------B.-------------------------------')
print('-ΠΡΙΝ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
print('Η τάση των οπλισμών του πυκνωτή είναι V1=Q1/C1 => V1={:.2f} V'.format(V1))
print('-ΜΕΤΑ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
V2 = Q1 / C2
print('Η τάση των οπλισμών του πυκνωτή είναι V2=Q1/C2 => V2={:.2f} V'.format(V2))

print()
print('---------------------------Γ.-------------------------------')
print('-ΠΡΙΝ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
E1 = V1 / l1
print('Η ένταση του ηλεκτρικού πεδίου είναι E1=V1/l1 => E1={:.2f} V/m'.format(E1))
print('-ΜΕΤΑ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
E2 = V2 / l2
print('Η ένταση του ηλεκτρικού πεδίου είναι E2=V2/l2 => E2={:.2f} V/m'.format(E2))

print()
print('---------------------------Δ.-------------------------------')
print('-ΠΡΙΝ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
U1 = (1 / 2) * Q1 * V1
print('Η ενέργεια του ηλεκτρικού πεδίου είναι U1=(1/2)*Q1*V1 => U1={:.4f} J'.format(U1))
print('-ΜΕΤΑ ΤΟΝ ΔΙΠΛΑΣΙΑΣΜΟ-')
U2 = (1 / 2) * Q1 * V2
print('Η ενέργεια του ηλεκτρικού πεδίου είναι U2=(1/2)*Q2*V2 => U2={:.4f} J'.format(U2))
