#!/usr/bin/python3
#Filename: 1_39.py
'''Άσκηση 39:

Δύο μεταλλικές πλάκες συνδέθηκαν με μπαταρία 4,5V.
Πόσο έργο απαιτείται για να μεταφερθεί φορτίο +4μC:

Α. Από την αρνητική στη θετική πλάκα;
Β. Από τη θετική στην αρνητική πλάκα;
Θεωρήστε την κινητική ενέργεια του φορτίου σταθερή.
'''

#Δεδομένα

Q =4*10**(-6)  # Φορτίο σε C.
V =4.5         # Τάση σε V


print()
W=Q*V
print('A. Για τη μετακίνηση του θετικού φορτίου από την αρνητική στη θετική πλάκα \
απαιτείται έργο εξωτερικής δύναμης ίσο με το αρνητικό έργο της δύναμης \
του πεδίου. Άρα: \n\tW=Q*V => W={:.2e} m'.format(W) )
print()
print('B. Σ’ αυτή την περίπτωση το πεδίο μετακινεί το φορτίο αυθόρμητα και \
επομένως θα πρέπει να ασκηθεί στο φορτίο εξωτερική δύναμη ώστε να μετακινηθεί \
με σταθερή κινητική ενέργεια. Το έργο αυτό θα είναι αντίθετο του έργου της \
δύναμης του πεδίου, άρα: \n\tW=-Q*V => W={:.2e} m'.format(-W) )
