#!/usr/bin/python3
#Filename:1_4.py

'''
Άσκηση 4:

Φορτίο 3∙10^-9 C βρίσκεται σε απόσταση 2cm από φορτίο q. Το
φορτίο q δέχεται ελκτική δύναμη μέτρου 27·10^-5 Ν. Να βρεθεί
το είδος και η ποσότητα του φορτίου q. Τα φορτία θεωρούνται
σημειακά

'''
from math import sqrt
from const import k
#Δεδομένα


Q=3*10**(-9)        #φορτιo
r=0.02              #απόσταση σε m.
F=27*10**(-5)       #Ελκτική δύναμη.

print('''Εφόσον δίδεται ότι η δύναμη είναι ελκτική το φορτίο q είναι αρνητικό.
Το μέτρο του φορτίου δίνεται από τη σχέση:''')
print(' |q|=(F*d^2)/(k*|Q| )')
print()
q=F*r**2/(k*Q)
print('q={:.1e} C'.format(q))
