#!/usr/bin/python3
# Filename: 1_40.py
'''Άσκηση 40:

Η ηλεκτρονική δέσμη στο σωλήνα μιας τηλεόρασης αποτελείται
από ηλεκτρόνια που επιταχύνονται από την κατάσταση ηρεμίας,
μέσω διαφοράς δυναμικού περίπου 20.000V.
Α. Ποια είναι η κινητική ενέργεια που αποκτούν τα ηλεκτρόνια;
Β. Ποια είναι η ταχύτητα των ηλεκτρονίων;
'''

from const import Qe  # Φορτίο ηλεκτρονίου σε C
from const import Me  # Μάζα ηλεκτρονίου σε Kg
from math import sqrt

# Δεδομένα

V = 20000  # Τάση σε V

print()
Ek = abs(Qe) * V
print('A. H κινητική ενέργεια που αποκτούν τα ηλεκτρόνια είναι Ek=|Q|*V:. Άρα: \n\t Ek={:.2e} J'.format(Ek))
print()

print()
u = sqrt(2 * Ek / Me)
print(
    'Β. Από την σχέση Εk=(1/2)*m*u², όπου Εk κινητική ενέργεια, Me μάζα ηλεκτρονίου και u η ταχύτητα που αποκτούν τα ηλεκτρόνια προκύπτει u= √(2Ek/Me), Άρα: \n\t u={:.2e} m/sec'.format(
        u))
