#!/usr/bin/python3
# Filename: 1_42.py
'''Άσκηση 42:

Μικρή αγώγιμη σφαίρα, που έχει μάζα 2 ∙ 10^-4kg και φορτίο +6μC,
βρίσκεται στην άκρη κατακόρυφου μεταξωτού νήματος ανάμεσα
στους κατακόρυφους οπλισμούς ενός πυκνωτή. Οι οπλισμοί του
πυκνωτή απέχουν απόσταση 5cm. Με ποια τάση πρέπει να φορ-
τιστεί ο πυκνωτής ώστε η σφαίρα να ισορροπεί σχηματίζοντας
με την κατακόρυφη, γωνία 30° (χωρίς να εφάπτεται στους οπλι-
σμούς);
'''

from math import tan  # εφαπτομένη, παιρνει όρισμα radians
from math import radians  # μετατρέπει τις γωνίες από μοίρες σε radians

# Δεδομένα
m = 2 * 10 ** (-4)  # μάζα σφαίρας σε Kg
q = 6 * 10 ** (-6)  # φορτίο σε C
l = 5 * 10 ** (-2)  # απόσταση οπλισμών σε m
θ = 30  # γωνία σε μοιρες
g = 9.81  # επιτάχυνση της βαρύτητας σε m/sec²

print()
print('Αφού η σφαίρα ισορροπεί σε γωνία θ={} τότε ισχύει Fhl=tan(θ)*Β => q*V/l = tan(θ)*m*g, άρα:'.format(θ))
V = (m * g * l * tan(radians(θ))) / q
print('V=(m*g*l*tan(θ))/q  => V={:2f} V'.format(V))
