#!/usr/bin/python3
#Filename:1_5.py

'''
Άσκηση 5:

Δοκιμαστικό φορτίο +2μC τοποθετείται στο μέσο της απόστασης
μεταξύ δύο φορτίων Q1 = +6μC και Q2 = +4μC, τα οποία απέχουν
απόσταση 10cm. Να βρεθεί η δύναμη που ασκείται στο δοκιμα-
στικό φορτίο.

'''
from math import sqrt
from const import k

#Δεδομένα

Q1=6*10**(-6)           #φορτιo
Q2=4*10**(-6)           #φορτιo
q=2*10**(-6)            #δοκιμαστικό φορτίο
r=0.10                  #απόσταση σε m.


print('''Η δύναμη που δέχεται το δοκιμαστικό φορτίο q είναι η συνισταμένη των
δυνάμεων F1 και F2 από τα φορτία Q1 και Q2 αντίστοιχα.''')
print(' |q|=(F*d^2)/(k*|Q| )')

F1=k*(Q1*q)/((r/2)**2)
F2=k*(Q2*q)/((r/2)**2)
SF=F1-F2
print()
print('Δύναμη που ασκείται μετάξυ Q1 και q είναι: F1={:.2f} Ν'.format(F1))
print('Δύναμη που ασκείται μετάξυ Q2 και q είναι: F2={:.2f} Ν'.format(F2))
print('άρα η συνισταμένη είναι:')
print('ΣF=F1-F2=>ΣF=({:.2f}-{:.2f}) N =>ΣF={:.2f}'.format(F1, F2, SF))
