#!/usr/bin/python3
#Filename:1_6.py

'''
Άσκηση 6:

Τρία φορτία +2μC, -3μC και -5μC τοποθετούνται πάνω σε ευθεία
και στις θέσεις Α, Β, Γ αντίστοιχα. Αν οι αποστάσεις μεταξύ των
φορτίων είναι (ΑΒ) = 0,4m και (ΑΓ) = 1,2m, να βρεθεί η δύναμη
που ασκείται στο φορτίο -3μC.

'''

from const import k

#Δεδομένα

Q1=2*10**(-6)               #φορτιo
Q2=-3*10**(-6)              #φορτιo
Q3=-5*10**(-6)              #φορτιo
AB=0.4                      #απόσταση σε m.
AG=1.2                      #απόσταση σε m.
#Q1<-----<-----Q2-----------Q3

BG=(AG-AB)
print('Η απόσταση ΒΓ είναι ΑΓ-ΑΒ, δηλαδή ΒΓ = {:.2f}-{:.2f} = {:.2f}m.'.format(AG, AB, BG))
print()
print('Μεταξύ του φορτίου Q1 και του φορτίου Q2 ασκείται δύναμη ελκτική αφού τα φορτία είναι αντίθετα \nάρα:')
F1=k*abs(Q1*Q2)/(AB**2)
print('F1={:.2f} N'.format(F1))

print()
print('Μεταξύ του φορτίου Q2 και του φορτίου Q3 ασκείται δύναμη απωθητική αφού τα φορτία είναι αρνητικά \nάρα:')
F2=k*abs(Q2*Q3)/(BG**2)
print('F2={:.2f} N'.format(F2))

print()
SF=F1+F2
print('''Επειδή οι δυνάμεις F1 , F2 είναι ομόρροπες η δύναμη που δέχεται το φορτίο Q2 είναι:
ΣF=F1+F2={:.2f}+{:.2f}={:.2f} N και έχει την ίδια κατεύθυνση με τις F1 και F2'''.format(F1, F2, SF))
