#!/usr/bin/python3
#Filename:1_7.py

'''
Άσκηση 7:

Να βρεθεί το μέτρο της έντασης ηλεκτροστατικού πεδίου, που δη-
μιουργεί φορτίο Q = -2μC, σε απόσταση 3cm από αυτό.
'''
from const import k

#Δεδομένα

Q=2*10**(-6)                #φορτιo
r=0.03                      #απόσταση σε m.


print('Το μέτρο της έντασης του πεδίου είναι: E=F/q')
print()
print('Επίσης από τον νόμο του Coulomb: F=k*|Q*q|/r^2  \nάρα: E=k*|Q|/r^2')

E=k*abs(Q)/r**2
print()
print('Η ένταση του πεδίου είναι:{:.0e} N/C και έχει φορά προς το φορτίο πηγή Q'.format(E))
