#!/usr/bin/python3
# Filename: 1_8.py
'''
Άσκηση 8:

Φορτίο +4∙10^-9 C δημιουργεί πεδίο έντασης μέτρου 3,6∙10^3 Ν/C
σε απόσταση r από αυτό. Να βρεθεί η απόσταση r.
'''
from const import k

# Δεδομένα

Q = 4 * 10 ** (-9)  # φορτιo
E = 3.6 * 10 ** 3  # H ένταση του πεδίου σε απόσταση σε r.

print('Το μέτρο της έντασης του πεδίου είναι: E=F/q')
print()
print('Επίσης από τον νόμο του Coulomb: F=k*|Q*q|/r^2  \nάρα: r=k*|Q|/E')

r = k * abs(Q) / E
print()
print('Η απόσταση στην όποία η ένταση του πεδίου είναι E={:.2e} N/C, είναι: r={:.2f}m'.format(E, r))
