#!/usr/bin/python3
#Filename: 1_9.py
'''
Άσκηση 9:
Η ένταση ηλεκτρικού πεδίου σε απόσταση 1cm από ηλεκτρικό
φορτίο-πηγή έχει μέτρο 36∙10^9 Ν/C. Να βρεθεί η ποσότητα του
ηλεκτρικού φορτίου.
'''
from const import k

#Δεδομένα

E=36*10**9                 #H ένταση του πεδίου σε απόσταση σε r.
r=0.01                      #Η απόσταση σε m.

print('Το μέτρο της έντασης του πεδίου είναι: E=F/q')
print()
print('Επίσης από τον νόμο του Coulomb: F=k*|Q*q|/r^2  \nάρα: |Q|=E*r^2/k')

Q=E*r**2/k
print()
print('Η η ποσότητα του ηλεκτρικού φορτίου είναι Q={:.0e} C'.format(Q))
