#!/usr/bin/python3
# Filename:1_7.py

'''
Οι παρακάτω φυσικές ποσότητες, όπου χρειάζονται, θα θεω-
ρούνται γνωστές
'''

# Δεδομένα
k = 9 * 10 ** 9             # ηλεκτροστατική σταθερά  N*m^2/C^2
g = 9.81                    # παγκόσμια σταθερά της βαρύτητας
Qp = 1.6 * 10 ** (-19)      # Το φορτίο του πρωτονίου σε Coulomb
Qe = -Qp                    # Το φορτίο του ηλεκτρονίου σε Coulomb
Me = 9 * 10 ** (-31)        # Μάζα ηλεκτρονίου σε kg
Mp = 1.6 * 10 ** (-27)      # Μάζα πρωτονίου σε
e0 = 8.85 * 10 ** (-12)     # η απόλυτη διηλεκτρική σταθερά του κενού σε C^2/N∙m^2
h = 6.63 * 10**(-34)        # Σταθερά Planck σε J*sec
c = 3 * 10**8               # Ταχύτητα του φωτός στο κενό σε m/sec.
eV = 1.60217662 * 10**(-19) # Ενεργεια σε J