#!/usr/bin/python3
# filename 4_3.py
"""
Άσκηση 4.3

Η ενέργεια του ατόμου του υδρογόνου, όταν βρίσκεται στη θεμελιώδη
κατάσταση, είναι –13,6eV. Ηλεκτρόνια συγκρούονται με άτομα του υδρογόνου
τα οποία βρίσκονται στη θεμελιώδη κατάσταση. Τα άτομα διεγείρονται και
εκπέμπουν γραμμικό φάσμα που αποτελείται μόνο από μία γραμμή ορισμένης
συχνότητας. Ποια είναι η ελάχιστη και ποια η μέγιστη ενέργεια των ηλεκτρονίων
που διεγείρουν τα άτομα του υδρογόνου; (Η ορμή του ατόμου δε μεταβάλλεται
κατά την κρούση.)
"""

# ΘΕΩΡΗΤΙΚΗ ΑΣΚΗΣΗ