#!/usr/bin/python3
# filename 4_6.py
"""
Άσκηση 4.6

Ηλεκτρόνια επιταχύνονται μέσω τάσης 12,3V και περνάνε μέσα από αέριο
που αποτελείται από άτομα υδρογόνου τα οποία βρίσκονται στη θεμελιώδη
κατάσταση. Να υπολογιστούν τα μήκη κύματος της ακτινοβολίας που εκπέμπει
το αέριο. Η ενέργεια του ατόμου του υδρογόνου στη θεμελιώδη κατάσταση
είναι –13,6eV.
"""

import math
from const import c		# ταχύτητα του φωτός
from const import h		# σταθερά του Planc
from const import eV	# Ενέργεια σε J

# Δεδομένα
E1 = -13.6  	# Ενέργεια 1ης στάθμης σε eV
E = 12.3  		# Ενέργεια  σε eV
n1 = 1			# Κβαντικός αριθμός 1ης στάθμης
n2 = 2			# Κβαντικός αριθμός 2ης στάθμης
n3 = 3			# Κβαντικός αριθμός 3ης στάθμης


print()
print('α) Τα ηλεκτρόνια μπορεί να δώσουν οποιοδήποτε μέρος της ενέργειάς τους σε μια\n'
	  '   κρούση. Το άτομο διεγείρεται από την κατάσταση n=1 έως την κατάσταση n και\n'
	  '   απορροφά ενέργεια: E = En - E1 = E1 / n² - E1 , άρα:')
print('   n ≤ √(E1/E-E1) => n ≤ ', end='')
n=math.sqrt((E1/(E+E1)))
print(f'{n:.2f} \n')
print('   Επομένως το άτομο μπορεί να διεγερθεί από τη θεμελιώδη κατάσταση έως την\n'
	  '   κατάσταση n=2 ή n=3. Κατά την αποδιέγερσή του μπορεί να πραγματοποιήσει τις\n'
	  '   μεταβάσεις:')

print('\tα. n=3 σε n=2\n'
	  '\tβ. n=3 σε n=1\n'
	  '\tγ. n=2 σε n =1')

print('\tΓια καθεμιά από τις παραπάνω μεταβάσεις εκπέμπεται ένα φωτόνιο, το μήκος\n'
	  '\tκύματος του οποίου υπολογίζεται από την σχέση: λ=h*c/E ')
print()

print('\tα) μετάβαση από n=3 σε n=2: λ32= h*c/ (E3-E2)=h*c/((E1/n3**2)-(E1/n2**2)) => λ32 = ', end='')
λ32 = h*c/(((E1/n3**2)-(E1/n2**2))*eV)
print(f'{λ32:.2e} m')

print('\tβ) μετάβαση από n=3 σε n=1: λ31= h*c/ (E3-E1)=h*c/((E1/n3**2)-(E1/n1**2)) => λ31 = ', end='')
λ31 = h*c/(((E1/n3**2)-(E1/n1**2))*eV)
print(f'{λ31:.2e} m')

print('\tγ) μετάβαση από n=2 σε n=1: λ21= h*c/ (E2-E1)=h*c/((E1/n2**2)-(E1/n1**2)) => λ31 = ', end='')
λ21 = h*c/(((E1/n2**2)-(E1/n1**2))*eV)
print(f'{λ21:.2e} m')