#!/usr/bin/python3
# filename 4_7.py
"""
Άσκηση 4.7

Σε σωλήνα παραγωγής ακτίνων X τα ηλεκτρόνια επιταχύνονται από τάση 10kV.
Να υπολογιστεί η μέγιστη συχνότητα και το ελάχιστο μήκος κύματος των ακτίνων
X που παράγονται.

"""

import math
from const import h			# σταθερά του Planck
from const import Qe		# φορτίο ηλεκτρονίου
from const import c			# ταχύτητα του φωτός

# Δεδομένα
V = 10 * 10 ** 3  # Τάση σε V

print()
print(f'Η ενέργεια που αποκτούν τα ηλεκτρόνια υπό τάση {V} V είναι:')
print('E = V * Qe\t(1)\tόπου Qe φορτίο ηλεκρονίου, επίσης \n'
	  'E = h * f\t(2)\tόπου f η συχνότητα εκπομπης φωτονίων, άρα:\n'
	  'h * f = V * Qe => f = V * Qe / h => f = ', end='')
f = abs(V * Qe / h)
print(f'{f:.2e} Hz')

print()
print('Το μήκος κύματος των ακτίνων Χ είναι λ = c / f => λ= ', end='')
λ = c / f
print(f'{λ:.2e} m')