#!/usr/bin/python3
# filename 4_8.py
"""
Άσκηση 4.8

Σε σωλήνα παραγωγής ακτίνων X εφαρμόζεται τάση (α) V1 = 10kV,
(β) V2 = 40kV.
Τα αντίστοιχα ελάχιστα μήκη κύματος των ακτίνων X είναι λ1 και
λ2. Να υπολογιστεί ο λόγος λ1/λ2.
"""

import math
from const import h			# σταθερά του Planck
from const import Qe		# φορτίο ηλεκτρονίου
from const import c			# ταχύτητα του φωτός

# Δεδομένα
V1 = 10 * 10 ** 3  # Τάση σε V
V2 = 40 * 10 ** 3  # Τάση σε V


print()
print(f'α) 	Η ενέργεια που αποκτούν τα ηλεκτρόνια υπό τάση {V1} V είναι:')
print( '	E2 = V1 * Qe\t(1)\tόπου Qe φορτίο ηλεκρονίου, επίσης \n'
	   '	E1 = h * f1\t(2)\tόπου f1 η συχνότητα εκπομπης φωτονίων, άρα:\n'
	   '	h * f1 = V1 * Qe => f1 = V1 * Qe / h => f2 = ', end='')
f1 = abs(V1 * Qe / h)
print(f'{f1:.2e} Hz')

print()
print(f'    Το μήκος κύματος των ακτίνων Χ για τάση V1={V1} V είναι λ1 = c / f1 => λ1= ', end='')
λ1 = c / f1
print(f'{λ1:.2e} m')


print('\n\n')

print(f'β) 	Η ενέργεια που αποκτούν τα ηλεκτρόνια υπό τάση {V2} V είναι:')
print( '	E2 = V2 * Qe\t(1)\tόπου Qe φορτίο ηλεκρονίου, επίσης \n'
	   '	E2 = h * f2\t(2)\tόπου f2 η συχνότητα εκπομπης φωτονίων, άρα:\n'
	   '	h * f2 = V2 * Qe => f2 = V2 * Qe / h => f2 = ', end='')
f2 = abs(V2 * Qe / h)
print(f'{f2:.2e} Hz')

print()
print(f'    Το μήκος κύματος των ακτίνων Χ για τάση V2={V2} V είναι λ2 = c / f2 => λ2= ', end='')
λ2 = c / f2
print(f'{λ2:.2e} m')

print('\n\n')
print(f'\tΣυνεπώς ο λόγος λ1/λ2 είναι {λ1/λ2}')
